var listData = [{
    name: '院系',
    tag: 'department',
    id: 1,
    width: 2,
    points: [{
      latitude: 39.9896608740,
      longitude: 116.3559758662,
    }, {
      latitude: 39.9929816771,
      longitude: 116.3573116064,
    }, {
      latitude: 39.9914404831,
      longitude: 116.3540822264,
    }, {
      latitude: 39.9909596232,
      longitude: 116.3574886322,
    }, {
      latitude: 39.9922172494,
      longitude: 116.3552516696,
    }, {
      latitude: 39.9921884804,
      longitude: 116.3556754586,
    }, {
      latitude: 39.9918103729,
      longitude: 116.3543826342,
    }, {
      latitude: 39.9921514915,
      longitude: 116.3545757531,
    }, {
      latitude: 39.9921391619,
      longitude: 116.3545918465,
    }, {
      latitude: 39.9894266033,
      longitude: 116.3569951057,
    }, {
      latitude: 39.9914322631,
      longitude: 116.3545382022,
    }, {
      latitude: 39.9883127791,
      longitude: 116.3577622174,
    }, {
      latitude: 39.9921884804,
      longitude: 116.3556754586,
    }, {
      latitude: 39.9910212720,
      longitude: 116.3549405336,
    }],
    markers: [{
      id: 1,
      latitude: 39.9896608740,
      longitude: 116.3559758662,
      name: '材料科学与工程学院',
      callout: {
        content: '材料科学与工程学院',
        color: '#4f4f4f',
        fontSize: 9,
        borderRadius: 5,
        bgColor: '#ffffff00',
        padding: 1,
        display: 'ALWAYS',
        textAlign: 'center',
      },
      iconPath: '/resources/location.png',
      width: 30,
      height: 30,
    }, {
      id: 2,
      latitude: 39.9929816771,
      longitude: 116.3573116064,
      name: '东凌经济管理学院',
      callout: {
        content: '东凌经济管理学院',
        color: '#4f4f4f',
        fontSize: 9,
        borderRadius: 5,
        bgColor: '#ffffff00',
        padding: 1,
        display: 'ALWAYS',
        textAlign: 'center',
      },
      iconPath: '/resources/location.png',
      width: 30,
      height: 30,
    }, {
      id: 3,
      latitude: 39.9914404831,
      longitude: 116.3540822264,
      name: '高等工程师学院',
      callout: {
        content: '高等工程师学院',
        color: '#4f4f4f',
        fontSize: 9,
        borderRadius: 5,
        bgColor: '#ffffff00',
        padding: 1,
        display: 'ALWAYS',
        textAlign: 'center',
      },
      iconPath: '/resources/location.png',
      width: 30,
      height: 30,
    }, {
      id: 4,
      latitude: 39.9909596232,
      longitude: 116.3574886322,
      name: '化学与生物工程学院',
      callout: {
        content: '化学与生物工程学院',
        color: '#4f4f4f',
        fontSize: 9,
        borderRadius: 5,
        bgColor: '#ffffff00',
        padding: 1,
        display: 'ALWAYS',
        textAlign: 'center',
      },
      iconPath: '/resources/location.png',
      width: 30,
      height: 30,
    }, {
      id: 5,
      latitude: 39.9922172494,
      longitude: 116.3552516696,
      name: '',
      callout: {
        content: '机械工程学院',
        color: '#4f4f4f',
        fontSize: 9,
        borderRadius: 5,
        bgColor: '#ffffff00',
        padding: 1,
        display: 'ALWAYS',
        textAlign: 'center',
      },
      iconPath: '/resources/location.png',
      width: 30,
      height: 30,
    }, {
      id: 6,
      latitude: 39.9921884804,
      longitude: 116.3556754586,
      name: '计算机与通信工程学院',
      callout: {
        content: '计算机与通信工程学院',
        color: '#4f4f4f',
        fontSize: 9,
        borderRadius: 5,
        bgColor: '#ffffff00',
        padding: 1,
        display: 'ALWAYS',
        textAlign: 'center',
      },
      iconPath: '/resources/location.png',
      width: 30,
      height: 30,
    }, {
      id: 7,
      latitude: 39.9918103729,
      longitude: 116.3543826342,
      name: '马克思主义学院',
      callout: {
        content: '马克思主义学院',
        color: '#4f4f4f',
        fontSize: 9,
        borderRadius: 5,
        bgColor: '#ffffff00',
        padding: 1,
        display: 'ALWAYS',
        textAlign: 'center',
      },
      iconPath: '/resources/location.png',
      width: 30,
      height: 30,
    }, {
      id: 8,
      latitude: 39.9921514915,
      longitude: 116.3545757531,
      name: '能源与环境工程学院',
      callout: {
        content: '能源与环境工程学院',
        color: '#4f4f4f',
        fontSize: 9,
        borderRadius: 5,
        bgColor: '#ffffff00',
        padding: 1,
        display: 'ALWAYS',
        textAlign: 'center',
      },
      iconPath: '/resources/location.png',
      width: 30,
      height: 30,
    }, {
      id: 9,
      latitude: 39.9921391619,
      longitude: 116.3545918465,
      name: '土木与资源工程学院',
      callout: {
        content: '土木与资源工程学院',
        color: '#4f4f4f',
        fontSize: 9,
        borderRadius: 5,
        bgColor: '#ffffff00',
        padding: 1,
        display: 'ALWAYS',
        textAlign: 'center',
      },
      iconPath: '/resources/location.png',
      width: 30,
      height: 30,
    }, {
      id: 10,
      latitude: 39.9894266033,
      longitude: 116.3569951057,
      name: '外国语学院',
      callout: {
        content: '外国语学院',
        color: '#4f4f4f',
        fontSize: 9,
        borderRadius: 5,
        bgColor: '#ffffff00',
        padding: 1,
        display: 'ALWAYS',
        textAlign: 'center',
      },
      iconPath: '/resources/location.png',
      width: 30,
      height: 30,
    }, {
      id: 11,
      latitude: 39.9914322631,
      longitude: 116.3545382022,
      name: '文法学院',
      callout: {
        content: '文法学院',
        color: '#4f4f4f',
        fontSize: 9,
        borderRadius: 5,
        bgColor: '#ffffff00',
        padding: 1,
        display: 'ALWAYS',
        textAlign: 'center',
      },
      iconPath: '/resources/location.png',
      width: 30,
      height: 30,
    }, {
      id: 12,
      latitude: 39.9883127791,
      longitude: 116.3577622174,
      name: '冶金与生态工程学院',
      callout: {
        content: '冶金与生态工程学院',
        color: '#4f4f4f',
        fontSize: 9,
        borderRadius: 5,
        bgColor: '#ffffff00',
        padding: 1,
        display: 'ALWAYS',
        textAlign: 'center',
      },
      iconPath: '/resources/location.png',
      width: 30,
      height: 30,
    }, {
      id: 13,
      latitude: 39.9921884804,
      longitude: 116.3556754586,
      name: '自动化学院',
      callout: {
        content: '自动化学院',
        color: '#4f4f4f',
        fontSize: 9,
        borderRadius: 5,
        bgColor: '#ffffff00',
        padding: 1,
        display: 'ALWAYS',
        textAlign: 'center',
      },
      iconPath: '/resources/location.png',
      width: 30,
      height: 30,
    }, {
      id: 14,
      latitude: 39.9910212720,
      longitude: 116.3549405336,
      name: '数理学院',
      callout: {
        content: '数理学院',
        color: '#4f4f4f',
        fontSize: 9,
        borderRadius: 5,
        bgColor: '#ffffff00',
        padding: 1,
        display: 'ALWAYS',
        textAlign: 'center',
      },
      iconPath: '/resources/location.png',
      width: 30,
      height: 30,
    }],
    list: [{
      title: '材料科学与工程学院',
      id: 100,
      latitude: 39.9896608740,
      longitude: 116.3559758662,
      imageList: [{
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/1_institute/i_cailiao1.jpg',
      }],
      detail: [{
        text: '北京科技大学是我国材料科学与工程类人才培养与科技创新的重要基地之一，有着悠久的历史和优良的传统。材料科学与工程学院于1996年10月由材料科学与工程系、金属压力加工系、表面科学与腐蚀工程系、冶金系的铸造教研室合并组建而成。1998年12月，应用科学学院的材料物理系和物理化学系无机非金属材料部分并入材料科学与工程学院，成立了材料物理系、金属材料系、无机非金属材料、功能材料与表面技术系、粉末材料系、表面科学与腐蚀工程系、金属压力加工系、铸造研究所等8个系（所）。2001年3月，8个系（所）重新整合，成立了材料学系、材料加工与控制工程系、材料物理与化学系、无机非金属材料系、粉末冶金研究所、功能材料研究所、腐蚀与防护中心、实验测试中心等4系2所2中心。2008年12月，根据学校的发展规划，以材料学院的2所2中心为主构建了新材料技术研究院。材料学院即形成了现在的架构，下设材料学系、材料加工与控制工程系、材料物理与化学系、无机非金属材料系、粉末冶金与先进陶瓷研究所。',
      }, {
        text: '材料科学与工程学科是首批国家一级重点学科和国家一级学科博士点，所属的3个二级学科也全部是首批国家重点学科、长江学者奖励计划特聘教授设岗学科，具有硕士学位和博士学位授予权，并设有博士后科研流动站。在2003和2007年教育部的一级学科评估中，分别排名第3（高校排名第2）和第2。2006年在中国管理科学研究院的《中国大学评价》中，排名第1。美国汤森路透公司ESI(Essential Science Indicators)2000-2010数据检索，我院材料科学与工程学科全球排名16, 进入该学科领域的1%。2011年据美国ESI数据检索，我校材料学科SCI论文数量一直稳居全球该学科领域的前1％，2010年全球排名16位，2011年排名13位。10余个学会及其二级学会挂靠我院材料科学与工程学科。如中国腐蚀与防护学会及其近10个二级学会。',
      }, {
        text: '本学科师资力量雄厚，名师荟萃，在国内外享有盛誉。教授112人，副教授79人，其中“中国科学院/工程院院士6人、千人计划入选者2人、长江学者特聘/讲座教授10人、国家杰青基金获得者6人、973首席科学家2人、国家级教学名师1人、教育部高校青年教师奖获得者1人、教育部跨世纪人才7人、百千万人才工程国家级人选4人、教育部新世纪人才29人等。拥有配套齐全的材料制备与分析条件，研究装备总值超过3亿元。材料科学与工程学院实验教学中心批准为北京市教学示范实验中心和国家级教学示范实验中心。获授权发明专利403项。出版专箸、教材48部，获奖者2人。全国百篇优秀博士论文提名9人，北京市优秀博士论文获得者7人。近五年发表在国内核心期刊发表学术论文4726篇，SCI收录论文1456篇，EI收录论文1571篇。影响因子3.0以上论文195篇。',
      }, {
        text: '学院在教学发展及改革方面一直走在全国的前列，尤其柯俊院士领导的“大材料”试验班取得了巨大成功，成为我国材料学科改革的典范。2007年由肖纪美院士和柯俊院士牵头，依托材料物理与化学国家重点学科，在2007级本科生中成立材料学院理科试验班，明确了培养高水平创新型材料科学研究人才的培养目标。为了实现人才培养的国际化，学院依托材料学国家重点学科，在2008级本科生中设立材料科学与工程专业国际班,其宗旨是进行与国际先进高教体系接轨工作的尝试，注重学生交流能力、领导能力和全球意识的培养，制定了培养国际型人才的全英文教学计划。国际班试点工作已在社会上引起了广泛关注，2009年，以国际班为试点的“材料科学与工程国际化人才培养试验区”被列为首批“北京市级人才培养模式创新试验区”。学院教师先后获得国家级教学成果奖一等奖2项、省部级教学成果奖7项。',
      }, {
        text: '学院在科研工作中坚持“注重基础，加强应用，发展交叉，促进联合”的科技工作方针，面向国际科技前沿和国家重大需求，开展基础研究和技术创新，积极推进科技成果的转化和商业化。在科研工作中同时注重科技人才的培养以及研究队伍建设，以平台和基础建设为基础，以创新团队建设为重点，促进科研能力稳步提升。强调团队组合，积极承揽国家重大、重点科研项目。本学科近三年承担科研项目1215项，实到经费6.01亿元。同时近3年组织主办、参加国际、国内会议336次。国外大学和科研机构学术交流平均每年约百余人次，与英国牛津大学、德国亚琛工业大学等世界著名大学建立全面合作关系。已举办中国材料名师讲坛51场。',
      }, {
        text: '材料学科60年来为国家培养了2万余名优秀人才，目前大多是各领域的栋梁和骨干。其中杰出人才代表有罗干、黄孟复等党和国家领导人，有王崇愚、叶恒强、周邦新、柯伟、何季麟、王一德、陈国良、张统一等12名中国科学院或中国工程院院士，以及数十名国家特大型企业或高新企业的董事长、总经理等。',
      }, {
        text: '面向新世纪，学院的发展目标是：建成学科方向齐全、综合实力雄厚、国内前茅、国际上有重要影响的人才培养、基础研究与技术创新的高水平研究型学院。',
      }],
    }, {
      title: '东凌经济管理学院',
      id: 101,
      latitude: 39.9929816771,
      longitude: 116.3573116064,
      imageList: [{
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/1_institute/i_jingguan1.jpg',
      }],
      detail: [{
        text: '北京科技大学东凌经济管理学院的历史可以追溯到上个世纪五十年代初期设立于北京钢铁学院的“冶金经济与企业组织”。1981年成立管理科学系，1993年改称管理学院，2006年更名经济管理学院。2011年5月，学校批准广东东凌集团对学院捐款冠名，学院更名为东凌经济管理学院。2013年，学院通过AMBA认证，成为全球200余所通过AMBA认证的优秀商学院群体中的一员。经过半个世纪几代师生员工的共同努力，目前已发展成具有相当水平和规模，在国内外有一定影响的管理教育与研究机构。',
      }, {
        text: '学院目前有信息管理与信息系统、工程管理、工商管理、会计学、国际经济与贸易和金融工程六个本科专业，分别可授予管理学、经济学学士学位；有管理科学与工程、企业管理、技术经济及管理、国际贸易学、产业经济学、金融学、会计学、工业工程、项目管理、会计学专硕、工商管理硕士（MBA）和高级工商管理硕士（EMBA）十二个硕士学位的学位授予权，其中管理科学与工程、企业管理、会计学、技术经济及管理四个专业具有博士学位授予权，学院并设有管理科学与工程专业的博士后流动站。',
      }, {
        text: '学院拥有一支具有丰富理论及实践经验的教师队伍。截至2016年12月，学院共有教职工135人，其中：教师94人，教授25人，副教授42人，讲师27人；行政教辅人员28人，辅导员13人；另有校内兼职教师6人，校外兼职教授8人（含兼职博导4人）。学院教师博士率为87%，全院教师连续3个月以上出国访学率达80%。在完成教学任务的同时，老师们积极开展科学研究工作，承担了一大批国家级、省部级和企业委托的科研任务，并取得了很好的成果，获得多项省部级及以上奖励。',
      }, {
        text: '学院配备收藏众多国内外学术期刊和专业图书的信息资料中心；设备先进、全面开放的计算机中心；装备现代化的多功能学术报告厅、专用教室和案例讨论室，及一系列专业实验室。为各类学员的学习提供了完备的条件。',
      }, {
        text: '长期以来学院还一直与美国、英国、加拿大、德国等国著名大学商学院保持密切的教学与科研合作，经常进行相互间的学术交流活动。2002年开始的与美国德克萨斯大学阿灵顿分校合作开展的EMBA项目,获得学员的广泛赞誉和良好的社会影响。',
      }],
    }, {
      title: '高等工程师学院',
      id: 102,
      latitude: 39.9914404831,
      longitude: 116.3540822264,
      imageList: [{
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/1_institute/i_gaogong1.jpg',
      }],
      detail: [{
        text: '走出学院的近万名各类毕业生遍布全国，在工商企业、政府机关、事业单位及教学科研机构受到普遍欢迎和好评，其中相当一部分校友担任了重要的管理和领导职务。作为工程型人才培养“试验田”和“卓越计划”的具体执行机构，学校高等工程师学院成立于2010 年11 月8 日，是一所跨学科“书院”制的特殊本科学院，在“卓越计划”实施机制中属于首创。学院从组织架构、运行机制、培养模式、校企合作、国际化培养等方面不断摸索和总结可操作、可复制、可借鉴的工程教育培养体系，探索新时代工程型人才培养管理模式。',
      }, {
        text: '学院由党委办公室、综合管理办公室、学生事务与发展中心、国际工程教育中心、先进制造加工基地、电子技术实习基地、创新创业基地、钢铁生产全流程虚拟仿真实践教学平台组成。',
      }, {
        text: '中国冶金行业卓越工程师培养联盟秘书处、校企共建国家级工程实践教育中心管委会秘书处常设于此。学院运行团队由52 人的管理人员和教学辅助人员组成，不设置教师岗位，所有教师均从其他学院和合作企事业聘任。设有材料科学与工程（卓越计划）、机械工程（卓越计划）、冶金工程（卓越计划）、矿物资源工程（卓越计划）、 自动化（卓越计划）、热能与动力工程（卓越计划）六个专业，所有进入“卓越计划”的学生统一按照工科试验班进行管理。截至目前，累计进入“卓越计划”学生达到1,400 余人。近年来，本科毕业生就业率保持在100%，深造率83.3% 以上。',
      }],
    }, {
      title: '化学与生物工程学院',
      id: 103,
      latitude: 39.9909596232,
      longitude: 116.3574886322,
      imageList: [{
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/1_institute/i_huasheng1.jpg',
      }],
      detail: [{
        text: '北京科技大学化学与生物工程学院成立于2010年8月18日，源于建校时期成立的基础部化学专业。经过60余年的建设，在学科增长、科学研究和教育教学等方面实现了跨越式发展。学院现设2个系：化学与化学工程系、生物科学与工程系；3个省部级重点实验室：功能分子与晶态材料科学与应用北京市重点实验室、北京科技大学农药残留与环境毒理实验室（农业部农药登记残留试验认证单位）、生物工程与传感技术北京市重点实验室；2个挂靠单位：生物工程与传感技术研究中心、精准医疗与健康研究院。',
      }, {
        text: '学院现有 1 个一级学科博士授权点，4 个硕士学科点，1 个博士后科研流动站，化学学科连续 5年进入全球 ESI 排名前 1%。学院有教职工 89 人，其中专任教师 76 人，博士生导师 20 人、教授 28人、副教授 26 人。学院有国家“千人计划”项目特聘教授 1 人，“长江学者奖励计划”特聘教授 1 人，国家杰出青年科学基金获得者 2 人，“万人计划”领军人才 2 人，国家百千万人才工程人选 1 人，国家优秀青年科学基金获得者 1 人，教育部新世纪人才 8 人，北京市科技新星 6 人。在校本科生、硕士研究生、博士研究生及留学生 700 余人。',
      }],
    }, {
      title: '机械工程学院',
      id: 104,
      latitude: 39.9922172494,
      longitude: 116.3552516696,
      imageList: [{
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/1_institute/i_jixie1.jpg',
      }, {
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/1_institute/i_jixiexuyuan2.jpg',
      }, {
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/1_institute/i_jixiexueyuan1.jpg',
      }],
      detail: [{
        text: '机械工程学院溯源至1952年北京科技大学（原北京钢铁工业学院）建校初期的钢铁机械系。经过六十五年的建设与发展，学院现设有6个本科生专业（机械工程、车辆工程、物流工程、工业工程、工业设计、视觉传达设计）、3个研究生学科（机械工程，物流工程，设计艺术学）、4个工程硕士专业（机械工程、车辆工程、物流工程、工业工程）。研究生学科中，“机械工程”具有国家一级学科博士授予权，是北京市重点学科，并设有博士后流动站；“物流工程”可授予工学或管理学博士学位；“设计艺术学”具有艺术学硕士学位授予权。4个工程硕士专业中，“机械工程”90年代开始在全国率先开展在职人员硕士研究生培养工作，优秀的培养质量使学院在国内冶金企业中赢得了良好声誉。学院的学科专业涵盖工学、管理学和艺术学三大门类，每年招收本科生400余人，博士和硕士研究生300余人，培养艺术与工程结合的复合型人才已成为学院的鲜明特色。',
      }, {
        text: '学院拥有包括中国工程院院士、英国皇家工程院院士、国家千人计划入选者、国家杰出青年基金获得者、中国科学院“百人计划”研究员、教学名师等在内的高水平师资队伍和久负盛名的国家级教学团队。学院现有教职员工170余人，其中专任教师120余人、教授30余人、副教授50余人。学院下设7个系、4个研究所，拥有3个省部级重点实验室、工程中心。学院的科技创新基地，为培养和支持大学生开展科技创新活动提供了良好的条件。近年来，学院学生在“挑战杯”大赛、全国大学生机器人大赛、智能车国际大赛和全国大赛、全国大学生先进成图技术与产品信息建模创新大赛、全国大学生机械创新设计大赛、全国大学生物流设计大赛、全国大学生原创动漫设计大赛、全国大学生节能减排大赛、全国大学生数学（英语、物理等）全国性的科技竞赛和学科竞赛中获得了优异的成绩，在全国高校名列前茅。',
      }, {
        text: '六十五年来，学院培养了15000余名本科生、3000余名硕士生和400余名博士生，其中有中国工程院院士、有中国深海载人潜水器“蛟龙号”总指挥，有中国载人航天工程专家，有政界精英、企业领袖等一批国家政治、经济、科技、教育等领域的栋梁和骨干。',
      }, {
        text: '六十五年来，我院产生了许多在国际和国内具有重要影响的成果：世界第一台弧形连铸机、我国最早的重型工业机械手、最早的热连轧计算机控制实验系统、最早的楔横轧实验研究基地均诞生在我院；第十六届亚运会火炬“潮流”也是由我院青年教师主持设计，实现了艺术与工程的完美结合。我院获得以“国家科技进步特等奖”为代表的100多项国家级和省部级科技和教学成果奖等。这些成果见证了学院为我国的科技发展、经济腾飞做出的卓越贡献。',
      }, {
        text: '学院与国外数十所知名大学、著名研究机构和大型企业保持着密切的合作关系，形成了包括国家级层面的国际合作机制，完成了数十项国际合作项目，成功举（承）办十余次大型国际学术会议。学院提供条件，鼓励学生到校外、境外的学校、科研机构学习、研究、攻读学位。每年有百余名同学赴海外知名大学学习或参加学术活动，邀请校外、境外的学者来学院讲学、讲课，促进了学院的国际化，扩大了学生的国际视野。',
      }, {
        text: '立德树人，求实鼎新。机械工程学院已发展成为北京科技大学规模最大、专业门类最多、学科特色突出的精英人才培养和高水平科研基地。',
      }],
    }, {
      title: '计算机与通信工程学院',
      id: 105,
      latitude: 39.9921884804,
      longitude: 116.3556754586,
      imageList: [{
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/1_institute/i_jitong1.jpg',
      }, {
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/1_institute/i_jitong2.jpg',
      }],
      detail: [{
        text: '1973年，北京钢铁学院成立计算机教研室，1975年设立计算机应用专业，1986年成立计算机系，下设计算机软件工程教研室、计算机应用教研室和计算中心。经过四十余年的建设，2011年计算机与通信工程学院成立，秉承“厚德博学，求实创新”的优良传统，学院抢抓机遇，加强建设，深化改革，内涵发展，在学科建设、科学研究水平和教育教学质量上实现了跨越式的发展与大力提升。',
      }, {
        text: '学院设有计算机科学与技术系、通信工程系、物联网与电子工程系、信息基础科学系4个系，软件工程与空间网络安全研究所、计算机与系统科学研究所、知识工程研究所、先进网络技术与新业务研究所等多个研究所以及“材料领域知识工程北京市重点实验室”、“融合网络与泛在业务北京市工程研究中心”和“北京市高等教育教学实验示范中心”、“北京高等学校示范性校内创新实践基地”和“赛博（网电空间）北京市国际科技合作基地”等多个省部级教学科研基地。',
      }, {
        text: '学院拥有一支知识储备深厚、年龄结构合理、学术思想活跃的一流师资队伍。现有教职工140人，专任教师100人，其中长江学者特聘教授1人、国家杰出青年科学基金获得者1人、教育部新世纪优秀人才4人、北京市教学名师1人、博士生导师24人、教授30人、副教授47人。此外，还有一支以中国工程院原副院长邬贺铨院士、国家“千人计划”特聘专家刘明博士领衔的20余名国内外知名教授组成的兼职教授队伍。',
      }, {
        text: '学院的学科建设与专业设置始终紧紧围绕信息技术领域的国际前沿和国家需求。学院拥有计算机科学与技术、信息与通信工程2个一级学科博士点，计算机系统结构、计算机应用技术、计算机软件与理论、通信与信息系统、信号与信息处理5个二级学科博士点以及计算机科学与技术、软件工程、信息与通信工程3个博士后流动站，计算机系统结构、通信与信息系统2个二级学科北京市重点学科；拥有计算机科学与技术、信息与通信工程2个一级学科硕士点和计算机技术、电子与通信工程2个工程硕士点；拥有计算机科学与技术、通信工程、信息安全、电子信息工程、物联网工程5个本科专业，其中，计算机科学与技术、通信工程两个专业通过教育部中国工程教育专业认证。学院现有本科生1500余人，博士和硕士研究生700余人，留学生100余人。',
      }, {
        text: '近年来，学院承担了国家高技术研究发展计划（“863”计划）、国家科技支撑计划、国家重点基础研究发展计划（“973”计划）、国家科技基础条件平台建设、国家重点研发计划、省部级重点科研项目等150余项，学术研究方向涵盖计算机科学与技术、软件工程、网络与通信、无线移动通信系统、信息安全、物联网、云计算、三网融合等信息技术的国际前沿领域。科研成果丰硕，曾获国家科技进步一等奖和二等奖、教育部自然科学二等奖、技术发明二等奖等省部级以上奖励20余项。其中，以“热连轧计算机控制系统集成”、“大型深采矿山资源开发风险防控关键技术”、“IEC 62601:2011用于过程自动化的WIA通信网络与通信规范”等为代表的一批成果攻克了生产计算机控制、智能优化调度、工业物联网无线传输等多项技术难题，为行业企业的信息化和国家冶金材料工业的科技进步做出了重要贡献，产生了巨大的经济效益和社会效益，在国民经济建设中发挥了重要作用。',
      }, {
        text: '学院积极开展对外学术交流与合作，与国内外诸多著名高校、科研机构和企业建立了紧密的合作关系，保持着广泛的国际国内学术联系与交流。开设“计算机与通信前沿技术名家讲坛”，定期邀请国内外知名学者来院讲学，营造浓厚的学术氛围，努力为学生创造接触国内外名师的机会，体验新兴的学术思想和成果。学院十分注重推动教师和学生的国际交流活动，努力拓宽教师和学生的国际视野。近年来学院与美国加州大学伯克利分校、密西根大学、法国图尔大学、澳大利亚昆士兰大学等多所国外知名大学进行了紧密的国际学术交流与合作。每年选派学生到国际一流大学进行“2+2”、“3+1”或“3+2”等模式的联合培养与国际交流，每年均有10-15%的毕业生前往美国卡内基梅隆大学、伊利诺伊理工大学、法国图尔大学、德国亚琛工业大学等国际一流大学继续深造。学院教师积极承办本学科高水平国际会议，在国际会议担任大会主席/程序委员会主席;相当一部分老师担任了IEEE TETC、IEEE Sen.J.、IEEE IOT J.、IEEE Sys. J.等著名期刊编辑/客座编辑，2014年学院获批“赛博（网电空间）北京市国际科技合作基地”。',
      }, {
        text: '学院积极推进特色专业建设和特色课程建设，推动教育教学改革，努力提高人才培养质量。拥有计算机科学与技术、物联网工程2个国家级特色专业，国家精品视频公开课建设项目、“十二五”普通高等教育本科国家级规划教材、北京高等教育精品教材等多部省部级教材。曾获国家教育教学成果二等奖、中国高教学会教学成果论文一等奖、北京市教育教学成果一等奖等教学奖励多项。学院致力于拔尖创新人才的培养，注重营造浓厚的科技创新氛围，多措并举助力学生开展科技创新创业活动，唤醒学生创新创业意识，提升学生创新创业能力，培育科技创新创业人才。在学院传统本科生科技社团——索思科技协会的基础上，积极搭建学生创新创业平台，成立索思科技创新实验室、“勤敏轩”创新实验室和满井谷“互联网+” 创新创业平台，开展各类科技创新活动。依托北京高等学校示范性校内创新实践基地，形成了“面向低年级学生的学科基本技能入门培训体系”、“面向高年级学生的创新系列指导培训体系”和“面向全校师生的创新创业培养体系”。近三年，有序组织学生参与全国大学生“挑战杯”竞赛、全国大学生电子设计大赛，全国大学生机器人大赛、全国大学生智能车大赛、全国大学生物联网创新创业大赛、中国大学生计算机设计大赛等科技竞赛中取得佳绩。学生获得国际级奖项20人次，国家级奖项500人次，累计学生参与竞赛4000余人次，人均竞赛获奖数为全校第一，基本做到竞赛全覆盖，并将学生科技创新竞赛学分纳入到毕业考核中。“秋菠网”、“七彩贝壳-掌上校园”、“赏金猎人”等多个项目成为校园学生科技创新创业项目的品牌，引起人民网、中国教育新闻网等媒体的广泛关注。',
      }, {
        text: '随着国家建设信息强国目标的确立，随着新兴信息技术向纵深化发展，必将为我们培养的创新拔尖人才提供更多的就业机会。学院依托信息学科优势，为社会各界输送了大批拔尖创新人才，每年毕业研究生就业率100%，本科生就业率保持97%以上。我院毕业生素以理论基础扎实、应用研究能力强、工作踏实肯干、为人朴实诚信等特点而赢得用人单位的广泛好评，赢得了用人单位的广泛好评。很多毕业生已成为国防工业和IT行业领军人物、业界精英和技术骨干，并涌现出了中央军委副主席范长龙、广州军区副司令员邢书成、中国计算机学会秘书长杜子德、阿里巴巴集团副总裁刘振飞等杰出校友代表。',
      }, {
        text: '随着“中国制造2025”、“互联网+”等政策的出台，新一轮科技革命和产业革命蓄势待发。作为以信息学科为立的学院，我们将发挥学科优势，积极对接国家重大战略需求，努力将学院建设成为学科特色鲜明、多学科协调发展，在计算机系统结构、通信与信息系统学科具有明显优势，在物联网工程、智能信息处理、云计算等交叉学科方向具有较大国际国内影响的研究型学院。',
      }],
    }, {
      title: '马克思主义学院',
      id: 106,
      latitude: 39.9918103729,
      longitude: 116.3543826342,
      imageList: [{
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/1_institute/i_mayuan1.jpg',
      }, {
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/1_institute/i_mayuan2.jpg',
      }],
      detail: [{
        text: '北京科技大学马克思主义学院成立于2009年9月，其前身为北京钢铁工业学院政治教研组（1953年）。2011年8月，马克思主义学院完全独立设置。学院主要承担全校本科生及研究生的思想政治理论课教学工作，以及马克思主义理论与相关专业学科建设、人才培养、科学研究和社会服务等任务。学院设有5个教学科研机构：思想政治教育研究所、马克思主义原理研究所、马克思主义中国化研究所、历史与文化研究所、科技与社会研究所。教育部全国高校思想政治教育研究会会刊《思想教育研究》编辑部、北京科技大学思想政治教育研究中心、北京科技大学高校学生事务研究中心、北京科技大学廉政研究中心挂靠学院。北京高校辅导员培训研修基地、北京高校形势与政策教育研究会秘书处设在本院。',
      }, {
        text: '学院拥有一支年龄学历结构合理、教学水平高、科研能力强的师资队伍。学院拥有教职员工53人，其中专职教学科研人员47人，45岁以下的专职教师全部具有博士学位,博士生导师6人，副教授21人。另外，校内兼职教授及导师8人。现有教职工中，有教育部马克思主义理论学科教学指导委员会委员1人，教育部新世纪优秀人才支持计划资助人选1人，北京新世纪社会科学“百人工程”人选1人，北京市教学名师1人，北京高校马克思主义理论和思想品德学科带头人2人，2人入选教育部全国高校优秀中青年思想政治理论课教师择优资助计划，1人入选教育部全国高校思想政治理论课教学能手，1人入选教育部思想政治教育中青年杰出人才支持计划。',
      }, {
        text: '学院拥有思想政治教育二级学科博士点、马克思主义理论一级学科硕士点与科技哲学二级学科硕士点。其中，思想政治教育学科为北京市重点学科。学院先后招收过专转本、本科、二学位、专业学位（高校辅导员班）、硕士、博士等各层次学生，历年来为国内高等学校、企事业党政部门以及相关机构输送了数千名专业人才。2015年学院开设课程，招收思想政治教育双学位本科生。',
      }, {
        text: '学院的核心工作是承担全校本科生及研究生的思想政治理论课的教学工作，历来重视教学及教学研究工作，在思想政治理论课建设与教学方法改革方面有优良的传统和扎实基础。1995年，学校被冶金部定位唯一“两课”改革试点学校，被北京市定为7所“两课”改革试点学校之一。《思想道德修养与法律基础》被评为北京市精品课程，教学团队被评为北京市优秀教学团队。《中国近现代纲要》被评为校级精品课程。学院参与建设的大学生社会实践课程，2008年被教育部评为“国家精品课程，《〈大学生社会实践〉课程建设与实践》获第六届高等教育国家级教学成果二等奖。2012年，《求是》杂志刊文全面介绍学校思政课实践教学的改革与成果。n    在新世纪新阶段，学院全体师生以矢志不渝、甘于奉献、与时俱进，敢为人先的精神，秉承优良传统，脚踏实地，同心同德，正在以更高的标准加强学科建设、课程建设和队伍建设，增强学院的学术竞争力和影响力，续写马院新篇章。',
      }],
    }, {
      title: '能源与环境工程学院',
      id: 107,
      latitude: 39.9921514915,
      longitude: 116.3545757531,
      imageList: [{
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/1_institute/i_nenghuan1.jpg',
      }, {
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/1_institute/i_nenghuan2.jpg',
      }],
      detail: [{
        text: '北京科技大学能源与环境工程学院的历史可以追溯到1952年建校初期。经过60余载的建设发展，学院目前由热科学与能源工程系和环境工程系组成。学院现设有能源与动力工程、环境工程两个本科专业，2017年将新增环境科学、新能源科学与工程2个本科专业，其中能源与动力工程和环境科学与工程是国家“211工程”和“国家优势学科创新平台”重点支持和发展的学科；环境工程专业是“国家级特色专业建设点”，并于2014年通过了工程教育专业认证。学院拥有动力工程及工程热物理、环境科学与工程2个一级学科博士点和相应的博士后流动站，内含热能工程、工程热物理、动力机械及工程、流体机械及工程、制冷及低温工程、化工过程机械、环境科学、环境工程8个二级学科。其中热能工程为国家重点学科，工程热物理、环境工程为北京市重点学科。',
      }, {
        text: '学院师资力量雄厚，构建了一支以高层次人才为核心、青年教师为中坚力量的师资队伍，为学院的建设和发展提供强有力的人才资源保障。学院现有教授23人，副教授26人，讲师9人，教师博士后10人，实验室人员8人；拥有包括国家“973首席科学家”、“863主题专家”、千人计划入选者、国家优秀青年基金获得者、教育部新（跨）世纪优秀人才计划入选者、中科院百人计划入选者、北京市高等学校教学名师、北京市青年学科带头人、北京市科技新星获得者等在内的高水平教师团队。',
      }, {
        text: '学院在科研方面紧紧围绕国家科技发展的重大需求，先后承担国家973计划、863计划、科技支撑计划、重大专项、自然科学基金、国防973、教育部和北京市重点重大基金等多项国内外合作科研项目，总科研经费近5亿元。学院在节能减排、环境治理等领域取得重要科研成果，近5年累计获得国家科技进步奖4项，省部级奖15项，发明专利91项；发表SCI、EI检索论文600余篇。',
      }, {
        text: '学院注重实践创新，目前已建成北京市冶金工业节能减排重点实验室、北京市高效节能与环保工程研究中心、教育部新能源与节能环保技术创新引智基地、“国家能源与环境国际合作基地”、“城市和生活污染物处理与资源化”北京市国际科技合作基地、工业典型污染物资源化处理北京市重点实验室等教学科研基地。学生科技创新和学科竞赛硕果累累，参与学生比例高达90%，在“挑战杯”全国大学生课外学术科技作品竞赛、节能减排与社会实践科技竞赛、物理竞赛、数学建模竞赛等竞赛中名列前茅，近5年本科生获国家级和省部级的学科和科技竞赛奖1000多人次，其中特等及一等奖50余项。',
      }, {
        text: '学院十分重视国际合作和学术交流，与包括美国、英国、法国、德国、澳大利亚、瑞典、加拿大、俄罗斯、新加坡、日本、港澳台在内的数十个国家和地区的著名高校、知名研究机构、学术组织和大型企业保持着密切的合作关系，完成了数十项国际合作项目，成功举（承）办过多次大型国际学术会议，定期邀请海内外知名专家学者开展教学科研的深度合作，并建立了学生国际交流联合培养制度，为学生提供到海内外高校交流学习的机会。学院毕业的学生深造率（出国+考研）每年均保持在50%以上。',
      }, {
        text: '在未来的发展中，学院将始终以建成一流学科、一流学院为目标，紧跟国家战略，瞄准国际前沿，为实现天蓝、地绿、水净的美丽中国梦而奋进。',
      }],
    }, {
      title: '土木与资源工程学院',

      id: 108,
      latitude: 39.9921391619,
      longitude: 116.3545918465,
      imageList: [{
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/1_institute/i_tuzi1.jpg',
      }, {
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/1_institute/i_tuzixue2.jpg',
      }],
      detail: [{
        text: '北京科技大学土木与资源工程学院的前身是北京钢铁工业学院采矿系。采矿系是1952年建校伊始最早成立的系之一，由当时的北洋大学采矿系、华北大学工学院采矿系和清华大学采矿系为主组建。1985年，学校成立地质系。1994年11月，采矿系和地质系合并，组建资源工程学院。2002年1月，资源工程学院更名为土木与环境工程学院。2016年7月，学院更名为土木与资源工程学院。',
      }, {
        text: '目前，学院下设5个系、1个中心、4个研究所、1个教育部重点实验室和1个北京市重点实验室，即资源工程系、土木工程系、安全科学与工程系、矿物加工工程系、建筑环境与能源工程系，实验中心，空间遥感与GIS应用研究所、矿井避险技术研究中心、尾矿膏体处置技术研究中心、应用力学研究所、金属矿山高效开采与安全教育部重点实验室和城市地下空间工程北京市重点实验室。',
      }, {
        text: '学院学科特色鲜明，呈现出多学科和谐发展。目前拥有2个国家一级重点学科（矿业工程、安全科学与工程），2个国家二级重点学科（采矿工程、矿物加工工程），2个北京市重点学科（工程力学、岩土工程），以及2个国家特色专业（采矿工程、安全工程）和2个北京市特色专业（采矿工程、安全工程）。拥有4个一级学科博士点（矿业工程、力学、安全科学与工程、土木工程），11个二级学科博士点（采矿工程、矿物加工工程、工程力学、流体力学、安全科学与工程、岩土工程、结构工程、防灾减灾工程及防护工程、桥梁与隧道工程、市政工程、供热供燃气通风及空调工程），15个普通硕士学科点（采矿工程、矿物加工工程、工程力学、流体力学、安全科学与工程、岩土工程、结构工程、防灾减灾工程及防护工程、桥梁与隧道工程、市政工程、供热供燃气通风及空调工程、矿物学、矿产普查与勘探、地质工程、地球探测与信息技术），4个工程硕士授权领域（矿业工程、建筑与土木工程、地质工程、安全科学与工程），4个博士后流动站（矿业工程、力学、安全科学与工程、土木工程），5个本科专业（采矿工程、土木工程、安全工程、矿物加工工程、建筑设备与能源应用工程）。',
      }, {
        text: '学院有一支治学严谨的师资队伍，其中教授44人。师资队伍中，中国工程院院士1人，国务院学位委员会学科评议组成员1人，长江学者2人，国家杰出青年科学基金获得者2人，全国教学名师1人，全国模范教师1人，人事部新世纪百千万人才工程国家级人选4人，中国青年科技奖获得者2人，全国优秀科技工作者2人，教育部跨世纪优秀人才培养计划入选者2人，教育部新世纪优秀人才支持计划入选者9人，教育部创新团队1个，北京市教学名师3人，北京市优秀教学团队1个，北京市优秀教师2人，北京市高等学校青年学科带头人2人，北京市优秀青年骨干教师4人，宝钢教育基金优秀教师4人。学院教师们先后承担了国家科技支撑计划、“973”计划、“863”计划、国家自然科学基金项目等300余项，全年到校科研经费连续八年达到1亿元左右。',
      }, {
        text: '学院与美国、日本、澳大利亚、英国、瑞典、加拿大、俄罗斯、乌克兰等国的20余所大学和研究机构建立有合作关系。学院有30多位教师在国内外的学术机构中担任重要学术职务，如国际岩石力学局理事，国际岩石力学学会专业委员会委员，国务院学位委员会学科评议组成员，中国有色金属学会常务委员会副主任，中国金属学会采矿学会理事长，中国岩石力学与工程学会教育委员会主任委员等。目前，挂靠在学院的国家二级学会有四个，即：中国金属学会采矿专业委员会，中国岩石力学与工程学会教育委员会，冶金自动化学会CAD与CAM学术委员会， 中国硅酸盐学会工艺岩石学专业委员会；国际学会一个：亚洲太平洋国际流体包体学会。',
      }, {
        text: '今天的土木与资源工程学院正面临着前所未有的历史机遇，学院将秉持“厚德博学、砺能善创”的院训，发扬“学风严谨、崇尚实践”的优良传统，以建设重点学科为基础, 以提升科学研究创新能力为主体，以提高人才培养质量为核心任务，为全力打造特色鲜明、国内一流的研究型学院而努力奋斗！',
      }],
    }, {
      title: '外国语学院',
      id: 109,
      latitude: 39.9894266033,
      longitude: 116.3569951057,
      imageList: [{
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/1_institute/i_waiyuan1.jpg',
      }],
      detail: [{
        text: '北京科技大学于1985年成立外语系，2003年6月组建外国语学院。学院现有4系、1所、2室、3个中心，即英语语言文学系（外国语言文学研究所）、大学英语系、研究生英语系、亚欧语系；党委行政办公室、学生工作办公室；功能语言学研究中心、外语实验教学中心和外语培训中心。在学校党政领导下，学院坚持科学发展观，准确把握“提供优质外语资源支撑、打造优质外语资源平台，创造有效外语学习环境、浓厚校园外语学习氛围，创建外语专业品牌、在国内同类院校外语学科中具有与北京科技大学的地位和发展相适应影响”的定位，抢抓机遇，以昂扬的精神面貌取得了学院整体工作的跨越式发展。',
      }, {
        text: '学院设有英语、日语、德语三个本科专业，拥有外国语言文学一级学科博士学位授予权和一级学科硕士学位授予权，下设外国语言学及应用语言学、英语语言文学、日语语言文学和翻译硕士学位（MTI）四个二级学科硕士点。现拥有一批学有专长的专家、教授、学术带头人，及一支教学效果优秀的师资队伍。截至2015年12月，专任教师中有教授9人，副教授32人，教育部新世纪优秀人才2人，北京市教学名师3人，宝钢优秀教师奖获得者4人，北京市“青年英才计划”入选者4人，有博士学位或正在攻读博士学位教师30人。同时，还聘请了澳大利亚悉尼大学荣休教授Michael A. K. Halliday先生、麦考利大学荣休教授Ruqaiya Hasan先生、英国加的夫大学荣休教授Robin P. Fawcett先生、英国著名戏剧家Dominic Shellard教授、香港理工大学英语系主任Christian M. I. M. Matthiessen教授、香港城市大学Jonathan Webster教授、英国利物浦大学Geoff Thompson教授、英国加的夫大学Adam Jaworski教授、北京大学胡壮麟教授、中山大学黄国文教授、北京外国语大学何其莘教授、同济大学张德禄教授、复旦大学朱永生教授、厦门大学杨信彰教授、北京师范大学田贵森、刘象愚教授等16位国内外著名语言学家担任我院客座教授或兼职教授。聘请英、日、德语专业外籍教师12名，中外教师团队合作教学正在成为我校外语教学的特色和亮点。',
      }, {
        text: '学院注重教学改革和科学研究。2007年我校跻身为教育部全国大学英语教学改革示范点项目学校。2008-2010年，我院先后有1门课程被评为“国家级精品课程”、3门课程被评为“北京市精品课程”、大学英语教学团队获得“北京市优秀教学团队”光荣称号，教改成果获得北京市教育教学成果一等奖1项，二等奖2项，北京市精品教材2部。近五年，我院教师共承担省部级以上教研科研项目26项，发表核心期刊论文93篇；编著高等学校正式使用教材27部，其中国家级规划教材2部；出版专著或文集11部，译著14部。所培养学生大学英语四级考试一次通过率屡创新高、英日语专业学生专业四八级考试通过率名列前茅，在全国各类外语竞赛中捷报频传。学生的外语专业综合水平得到兄弟高校充分肯定，每年都有一批同学被保送至北大、清华、北外等著名高校免试攻读硕士研究生；近三年已派出106名学生赴英、美、德、日等国家交流学习。',
      }, {
        text: '学院始终坚持学有所用、学以致用、以用促学、学用统一的原则，高度重视学生的外语实践教学和第二课堂建设，目前拥有12个外语实践教育基地，以及北京科技大学外语文化节、首都高校外文电影配音邀请赛等经典品牌第二课堂活动。通过全校规模的英语演讲比赛、外语辩论赛、英文歌曲大赛、英语海报设计大赛、外语沙龙、外语广播、外教讲座以及全国各类外语比赛，为学生营造了浓厚的外语学习氛围。学院拥有现代化的数字语言实验室、同声传译实验室、电子阅览室、多媒体教室、外语自主学习中心，包含BBC、CNN、NHK、DW、国家地理、国际电影等境外卫星节目资源的外语教学多媒体资源中心以及藏书3万余册的图书期刊中心，为学生创造了有效的外语学习环境。',
      }, {
        text: '依托我校多科性学科优势，学院以为社会培养具有良好的社会责任感、扎实的外语基本功、综合素质好、实践能力强的外语专业人才为目标，努力构建北京科技大学外国语学院的专业品牌。',
      }],
    }, {
      title: '文法学院',
      id: 110,
      latitude: 39.9914322631,
      longitude: 116.3545382022,
      imageList: [{
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/1_institute/i_wenfa1.jpg',
      }],
      detail: [{
        text: '文法学院是北京科技大学覆盖学科门类最广泛的学院，包含法学、社会学、政治学、文学、公共管理等多个学科。多年来，学院积极倡导“宽容与和谐”、“学习与研究”的精神，力争做到教学与科研并重，基础教学与专业教学并进，努力在理工科大学开辟和发展人文社会科学教育事业，逐步形成学院自身的办学特色。文法学院设有公共管理系、法律系、社会学系、艺术教育中心等教学研究单位，学院代管的教学科研机构有教育经济与管理研究所、北京科技大学国家大学生文化素质基地、公共管理（MPA）教育与管理中心、法律硕士（JM）教育与管理中心等。',
      }, {
        text: '学院已形成从本科到博士研究生的较为完整的人才培养体系，目前，学院设有行政管理、法学、社会工作3个本科专业；有公共管理一级学科硕士点1个（含行政管理、教育经济与管理等5个二级学科硕士点）和民商法学、经济法学、社会学、高等教育学、科技与教育管理等5个二级学科硕士点；有科技与教育管理专业二级学科博士点；有公共管理硕士（MPA）和法律硕士（JM）2个专业硕士学位点；是全国首批公共管理硕士（MPA）专业学位试点院校。',
      }, {
        text: '学院拥有模拟法庭、社工实验室、社会调查与统计分析实验室、艺术鉴赏实验室、情景模拟室、电子政务室等先进教学设施；定期出版学术期刊《北京科技大学学报》（社会科学版），为师生提供学习和研究的园地。',
      }],
    }, {
      title: '冶金与生态工程学院',
      id: 111,
      latitude: 39.9883127791,
      longitude: 116.3577622174,
      imageList: [{
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/1_institute/i_yejin1.jpg',
      }],
      detail: [{
        text: '北京科技大学冶金与生态工程学院的历史可以上溯到1895 年成立的北洋大学矿冶学科，于1952 年由北洋大学等五所高校的冶金学科组建而成，是国家首批博士学位授权点、博士后流动站、国家一级重点学科和“211 工程”、“985 优势学科创新平台”重点建设学科。学院学科基础雄厚，冶金工程具有一级学科博士授予权，并设有博士后流动站；冶金工程学科为国家一级重点学科，在教育部2012 年公布的全国学科评估中冶金工程列本学科第二。学院现设有本科冶金工程专业。学院培养了大批杰出人才，为我国国民经济的发展、特别是冶金工业的发展做出了巨大贡献。经过60 多年的建设和发展，冶金学科成为特色突出、国内领先、国际知名的一级学科。',
      }, {
        text: '北京科技大学冶金学科的定位是：1）夯实基础理论创新，重视冶金工程和冶金物理化学方面的基础研究，在若干方面寻求重大理论突破，引领中国乃至世界冶金学的发展，驱动冶金工业技术进步；2）传承“钢铁摇篮”育人文化，为冶金工业和高校培养和输送创新型、国际化人才，成为中国和世界冶金学科人才培养的基地；3）与冶金企业协同创新，开发冶金新技术和高性能钢种，满足国家发展的重大需求，走在国际前沿，为国家“一带一路”和“京津冀协同发展”等重大战略提供冶金技术支撑；4）强化冶金过程节能减排研究，积极开发智能冶金新方向，开展以大数据为支撑的网络化冶金创新研究，使新方向的创新成为驱动冶金学科和冶金工业进一步发展的发动机。北京科技大学冶金学科的目标是：保持冶金学科在国内的领先地位，冲刺国际前列，打造国际一流学科，成为世界冶金教育与科研的中心。',
      }, {
        text: '冶金学科的优势与特色包括：1）师资力量雄厚：学院拥有一支高水平的师资队伍，其中教授36 名，中国科学院院士2 名、国务院学位委员会学科评议组成员1 名、“长江学者奖励计划”特聘教授3 名、“长江学者奖励计划”讲座教授1 名、国家“杰出青年基金”获得者1 名、国家级“百千万人才工程”入选者2名、科技部创新领军人才1 人、中组部“青年千人计划”学者2 名、中组部青年拔尖人才1 名、“长江学者奖励计划”青年学者1 人、基金委优秀青年科学基金项目获得者3 名、教育部“新世纪优秀人才”16 名、北京市教学名师2 人；外籍教师中海外名师1 人、“外专千人”1 人、高端外国专家1 人。大多数教师具有博士学位和出国留学、进修经历；2）科研平台一流：“金属与矿冶文化遗产研究”国家文物局重点科研基地、稀贵金属绿色回收与提取北京市重点实验室、高端金属材料特种熔炼与制备北京市重点实验室、稀贵金属绿色回收与提取北京市国际合作基地均依托本学院建设。学院是中国金属学会炼铁分会、炼钢分会、冶金过程物理化学分会、冶金反应工程分会及熔盐化学与技术分会的挂靠单位。拥有约2.1 亿元的大型先进仪器设备；3）产学研成果突出：过去五年，科研经费合计3.3 亿元，获国家自然科学基金115 项，其中重点基金11 项，优秀青年基金3 项；5 项国家科技支撑计划和“863”计划课题；与多个企业签订千万级研发合同；发表学术论文2297 篇、其中SCI 论文1038篇；授权专利202 件，其中33 项实现落地转化；出版专著12 部（1 部国外英文专著）；获国家科技进步二等奖2 项、省部级奖项61 项；4）国际化建设卓著：过去五年，启动全英文课程3 项、聘用3 名外国教授长期进行教学科研工作；年培养留学生17 人；10 人次在国外知名大学任兼职教授；11 人次担任国外期刊编委；国际合作课题总金额1732 万元；国外钢铁企业技术高管班接受本学科培训一次；在钢铁冶金方向的国外四大期刊上发表的文章数量从2012 年开始达到并一直保持世界第一。',
      }, {
        text: '学院秉承北京科技大学“求实鼎新”的校训，依托冶金学科优势，为社会各界尤其是冶金行业输送了大批专业技术人才和管理人才。培养了徐匡迪、刘淇、黄孟复等党和国家领导人，魏寿昆、李依依、周国治等中科院院士，殷瑞钰、毛新平等6 名中国工程院院士，陈德容、刘明忠、于勇、唐复平、孙国龙、钱刚等为代表的数十名国家特大型或大中型企业的董事长、总经理，杨天均、贺友多、董元箎、李保卫、李家新、杨斌、倪红卫、王建中、鲁雄光、安胜利、朱立光等为代表的数名冶金高校的校长、书记。2012 年以来，培养本科生1016 名、硕士生1127 名（含企业工程硕士353 名）、博士271 名。',
      }, {
        text: '近年来学院承担了多项国家重要科研项目和企业技改项目，多次获得国家自然科学奖、国家技术发明奖、国家科学技术进步奖等奖项，为国家的钢铁工业现代化做出了重要贡献。',
      }, {
        text: '面向未来，学院的发展目标是建成学科特色突出、综合实力雄厚、国内领先、国际上有重要影响的高水平研究型学院，并最终成为世界冶金教育与科研中心。',
      }],
    }, {
      title: '自动化学院',
      id: 112,
      latitude: 39.9921884804,
      longitude: 116.3556754586,
      imageList: [{
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/1_institute/i_zidonghua1.jpg',
      }, {
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/1_institute/i_zidonghua2.jpg',
      }],
      detail: [{
        text: '经过五十多年的发展，在孙一康、舒迪前、赵殿甲、余达太等老一辈专家学者的带领下，自动化学院逐步确立了在冶金自动化领域的领先地位，学科建设取得了飞跃发展，服务范围拓展到智能交通、智能信息处理、生物医学、新能源、国防等领域。学院师资力量雄厚，拥有国务院学位委员会学科评议组成员1人、国家千人计划入选者1人、国家杰出青年基金获得者2人、教育部新世纪优秀人才6人、北京市科技新星3人、北京市英才支持计划入选者5人、中国人工智能学会首批会士1人、国家科技重大专项项目负责人1人。',
      }, {
        text: '经过“211工程”和“985优势学科创新平台”的建设，学院拥有近5000平米的现代化信息大楼及价值5000多万元国内一流的实验设备和装置；承担国家“973”计划、“863”计划、国家自然科学基金及企业的重要研究课题经费近亿元，在流程工业先进控制技术、复杂非线性系统理论与控制方法、智能控制新理论新方法、新能源控制关键技术、新型传感器网络及信息融合等方向取得了重要研究成果，获得一大批国家级和省部级科技奖励，成为我国控制科学与工程、仪器科学与技术和智能科学与技术等领域的高水平人才培养基地，并在2012年教育部学科评估中全国“控制科学与工程”一级学科排名前20%。',
      }, {
        text: '学院所设学科和专业从基础理论研究到工程应用技术，全面对应自动化和信息领域技术的飞速发展和高级人才需求。其中，本科专业3个：自动化、测控技术与仪器、智能科学与技术；一级学科博士学位授权点2个：控制科学与工程（含控制理论与控制工程、检测技术与自动化装置、模式识别与智能系统、系统工程、导航制导与控制），仪器科学与技术（含测试计量技术及仪器，精密仪器及机械）；宽口径培养人才的一级学科硕士学位授权点2个：控制科学与工程、仪器科学与技术；工程硕士学位授权点2个：控制工程、仪器仪表工程。自动化、测控技术与仪器两个专业通过了工程教育专业认证，自动化专业是教育部CDIO特色专业；“控制理论与控制工程”为国家重点（培育）学科和北京市重点学科，还拥有“控制科学与工程”博士后流动站。',
      }, {
        text: '为适应快速发展的自动化和信息技术以及人才市场的需求，提高毕业生的深造和就业竞争力，本着厚基础、强专业、重创新的原则，对大学一、二年级的同学设置公共基础课平台，强化英语、高等数学、大学物理、计算机程序设计、电路与电子技术等课程教育，在专业课中设置了追踪最新技术的先进控制理论与应用、现代检测技术、智能控制、嵌入式系统、机器人控制等课程，并加强了科技创新活动实践教学环节。',
      }, {
        text: '学院本着“育人为本，教学卓越，研究创新，和谐向上”的建院宗旨，坚持育人为本的崇高理念，以卓越的师资队伍和教育环境培养具有服务国家服务人民的强烈社会责任感、扎实的专业基础、勇于探索的创新精神和善于解决问题的实践能力的自动化学科领域人才，以创新的高水平科学研究不断提高教育教学质量，以民主、团结、和谐、奋发向上的学院人文环境，共同创造美好的社会与人生。我们热忱地欢迎有志于在自动化领域建功立业的莘莘学子加盟我们的大军，为实现自己的理想、为人民的幸福生活、为国家的富强共同努力，做出更大贡献。',
      }],
    }, {
      title: '数理学院',
      id: 113,
      latitude: 39.9910212720,
      longitude: 116.3549405336,
      imageList: [{
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/1_institute/i_shuli1.jpg',
      }],
      detail: [{
        text: '北京科技大学数理学院发轫于北京钢铁学院建校伊始的基础部。1996年原数力系、物理系、化学系合并成立应用科学学院;2010年经过系所调整,更名为数理学院,揭开了新的历史篇章。',
      }, {
        text: '目前数理学院有教职工(含兼职等)145人，包括教授41人。副教授45人。高级工程师2人。聘请陈难先院士和郑厚植院士为学院顾问，美国科学院院士和美国艺术与科学院院士、哈佛大学David.A.Weitz教授为名誉教授，亚太材料科学院院士、新加坡国立大学冯元平教授为兼职教授，井聘请26位专家担任北京科技大学数理学科战略咨询委员会专家。师资队伍中，有国家“千人计划”特聘专家2名，国务院政府特殊津贴专家3名，北京市教学名师5名.教育部新世纪优秀人才4名，“青年千人计划”入选者1名。',
      }, {
        text: '目前学院下辖应用数学系、信息与计算科学系、物理系、应用物理系、应用力学系共5系，应用物理研究所、应用数学研究所共2所.现代物理技术研究中心、绿色创新中心、实验中心共3个中心;拥有物理学一级学科博士学位授权点，固体力学、一般力学与力学基础2个二级学科博士学位授权点;数学及统计学2个一级学科硕士学位授权点以及软件工程硕士学位授予点。',
      }, {
        text: '学院研究方向涵盖了凝聚态物理、理论物理、光学、原子与分子物理、应用数学、运筹学与控制论、固体力学等数理学科相关的主要领域。初步建成了以环境气氛球差校正透射电镜、200kV场发射能量过滤型透射电子显微镜、场发射枪扫描电镜、X射线衍射仪、振动样品磁强计、高性能计算机集群为代表的物质分析计算平台，设备总价值约5000万元。1997年成立科技部材料模拟设计实验室;2004年国家工科物理教学基地挂牌;2005年获批北京市高等学校实验教学示范中心;2012年获批北京市弱磁检测及应用工程技术研究中心;2016年获批磁光电复合材料与界面科学北京市重点实验室.并立项培育国防科技重点实验室。',
      }, {
        text: '学院每年承担全校200多门次课程的本科和研究生教学任务，全体教师兢兢业业，躬身于“三尺讲台”。教书育人，2名教师获全国高校青年教师教学竞赛一等奖，1名教师获首届全国大学物理青年教师讲课比赛二等奖。数理学院不断探索人才培养的新模式，取得了许多标志性数学成果。1997年承担教育部重点教改项目《”大材料”试点班专业人才培养方案及教学内容课程体系改革研究与实践》.2001年获得国家级教学改革成果一等奖;2007年创建北京科技大学理科试验班，以其为范本的《“2+X"创新人才培养模式的研究与实践》荣获2012年北京市高等教育教学成果-等奖，是为学院师生为创新高端人才培养模式、引领学校整体教育数学水平再上新台阶，做出的又一次鲜活而有价值的尝试; 2013年与中国科学院半导体研究所合作，创建“黄昆班”,2014年与中国科学院数学与系统科学研究院联合实施”闵嗣鹤数学精英计划“.探索出以”科教融合，协同育人”人才培养新模式。',
      }, {
        text: '雄厚的科研实力是高水平学院的重要标志。学院近五年来承担了百余项来自科技部、国家自然科学基金委员会、教育部、北京市等国家、省部级科研项目,科研经费以年均超过20%的速度增长;学院教师在数理及相关学科领域取得一系列具有重要影响的研究成果，在包括Nature系列刊物、Phys.Rev.系列、Appl.Phys.Lett.SIAM系列、Trans.Amer,Math.Soc.等刊物发表高水平学术论文年均超过100篇。根据最新QS世界大学学科排名, 2016年我校数学和物理学科均进入全球500强，位列国内工科院校前列;物理学科Nature指数排名位列国内高校第26名。',
      }, {
        text: '根据美国汤森路透公司ESI(Essential Science Indicators)检索数据，物理学科2016年11月进入该学科领域的全球前1%。学院教师还获得了包括国家自然科学奖一等奖、教育部自然科学一等奖在内的20余项国家、省部级科技奖项。1994年，陈难先教授开展的“莫比乌斯反演定理”研究获国家自然科学奖二等奖2011年,郑连存教授开展的“幂律流体非常规边界层传递行为研究”获北京市科技进步二等奖;2013年,王荣明教授合作完成的“过渡金属及其化合物纳米材料的可控合成、微结构及相关特性”研究,获国家自然科学奖二等奖; 2016年.王荣明、陈娣、宋玉军教授等完成的“磁、光功能材料的界面设计、调控和构效关系研究”获中国材料研究学会科学技术奖一等奖。',
      }, {
        text: '人才培养是大学的根本任务和首要职能。学院目前在册学生1176人。其中本科生981人，硕士210人，博士85人。在学院这个开放、自由、清朗、积极向上的时空里,学生们身心和思想激越旺盛，学习生活异彩纷呈。在“教学名师”的课堂上和教授指导的实验室里,学生们得到系统性地教育和科研训练，获得完备高阶的知识体系和基本的科研素养;在“挑战杯”全国大学生课外学术科技作品竞赛、各种学科竞赛中屡获佳绩;在多样化的社会实践大课堂中，“数学物理学长讲师团”走上讲台;“走进社区，关爱弱势群体”，传递青年学生的悲悯心怀和施援之举;去农村“红色1+1党支部共建”,与国情近距离;在大学生活的最后一个夜晚，“忆青春梦，留数理情”,毕业生纵情高歌劲舞——种种印记，都是青年学子认识自己、充实自我、心智成熟的成长经历。他们让自己变得会思考、有行动力，变得成熟、理性，佼佼者更不鲜见:8名学生(包括2名留学生)获得在校学生最高荣誉——校长奖章。',
      }, {
        text: '学院与美国加州伯克利大学、宾夕法尼亚州立大学、加拿大滑铁卢大学、英国邓迪大学、法国图尔大学、爱尔兰都柏林大学、日本北海道大学、新加坡国立大学、南洋理工大学等高校签订了合作办学协议,为本科生、研究生出国深造和合作研究提供了宽阔、优质的平台。',
      }],
    }, ]
  },
  {
    name: '教学楼',
    tag: 'teachingBuilding',
    id: 2,
    width: 3,
    points: [{
      latitude: 39.9901910626,
      longitude: 116.3559544086,
    }, {
      latitude: 39.9908938643,
      longitude: 116.3566142321,
    }, {
      latitude: 39.9914651424,
      longitude: 116.3561099768,
    }, {
      latitude: 39.9912062184,
      longitude: 116.3574832678,
    }, {
      latitude: 39.9921925902,
      longitude: 116.3556540012,
    }, {
      latitude: 39.9921638212,
      longitude: 116.3545596600,
    }, {
      latitude: 39.9910336019,
      longitude: 116.3549512625,
    }],
    markers: [{
      id: 1,
      latitude: 39.9901910626,
      longitude: 116.3559544086,
      name: '主楼',
      callout: {
        content: '主楼',
        color: '#4f4f4f',
        fontSize: 9,
        bgColor: '#ffffff00',
        display: 'ALWAYS',
      },
      iconPath: '/resources/location.png',
      width: 30,
      height: 30,
    }, {
      id: 2,
      latitude: 39.9908938643,
      longitude: 116.3566142321,
      name: '教学楼',
      callout: {
        content: '教学楼',
        color: '#4f4f4f',
        fontSize: 9,
        bgColor: '#ffffff00',
        display: 'ALWAYS',
      },
      iconPath: '/resources/location.png',
      width: 30,
      height: 30,
    }, {
      id: 3,
      latitude: 39.9914651424,
      longitude: 116.3561099768,
      name: '逸夫楼',
      callout: {
        content: '逸夫楼',
        color: '#4f4f4f',
        fontSize: 9,
        bgColor: '#ffffff00',
        display: 'ALWAYS',
      },
      iconPath: '/resources/location.png',
      width: 30,
      height: 30,
    }, {
      id: 4,
      latitude: 39.9912062184,
      longitude: 116.3574832678,
      name: '实验楼',
      callout: {
        content: '实验楼',
        color: '#4f4f4f',
        fontSize: 9,
        bgColor: '#ffffff00',
        display: 'ALWAYS',
      },
      iconPath: '/resources/location.png',
      width: 30,
      height: 30,
    }, {
      id: 5,
      latitude: 39.9921925902,
      longitude: 116.3556540012,
      name: '机电信息楼',
      callout: {
        content: '机电信息楼',
        color: '#4f4f4f',
        fontSize: 9,
        bgColor: '#ffffff00',
        display: 'ALWAYS',
      },
      iconPath: '/resources/location.png',
      width: 30,
      height: 30,
    }, {
      id: 6,
      latitude: 39.9921638212,
      longitude: 116.3545596600,
      name: '土木环境楼',
      callout: {
        content: '土木环境楼',
        color: '#4f4f4f',
        fontSize: 9,
        bgColor: '#ffffff00',
        display: 'ALWAYS',
      },
      iconPath: '/resources/location.png',
      width: 30,
      height: 30,
    }, {
      id: 7,
      latitude: 39.9910336019,
      longitude: 116.3549512625,
      name: '理化楼',
      callout: {
        content: '理化楼',
        color: '#4f4f4f',
        fontSize: 9,
        bgColor: '#ffffff00',
        display: 'ALWAYS',
      },
      iconPath: '/resources/location.png',
      width: 30,
      height: 30,
    }, ],
    list: [{
        title: '主楼',
        id: 200,
        latitude: 39.9901910626,
        longitude: 116.3559544086,
        imageList: [{
          url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/2_building/b_main1.jpg',
        }, {
          url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/2_building/b_main2.jpg',
        }, {
          url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/2_building/b_main3.jpg',
        }, {
          url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/2_building/b_main4.jpg',
        }],
        detail: [{
          text: '信息完善中……',
        }],
      }, {
        title: '教学楼',
        id: 201,
        latitude: 39.9908938643,
        longitude: 116.3566142321,
        imageList: [{
          url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/2_building/b_jiaoxue1.jpg',
        }],
        detail: [{
          text: '信息完善中……',
        }],
      }, {
        title: '逸夫楼',
        id: 202,
        latitude: 39.9914651424,
        longitude: 116.3561099768,
        imageList: [{
          url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/2_building/b_if1.jpg',
        }, {
          url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/2_building/b_if2.jpg',
        }, {
          url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/2_building/b_if3.jpg',
        }, {
          url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/2_building/b_if4.jpg',
        }, {
          url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/2_building/b_if5.jpg',
        }, {
          url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/2_building/b_if6.jpg',
        }, {
          url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/2_building/b_if7.jpg',
        }, {
          url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/2_building/b_if8.jpg',
        }, {
          url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/2_building/b_if9.jpg',
        }],
        detail: [{
          text: '信息完善中……',
        }],
      }, {
        title: '实验楼',
        id: 203,
        latitude: 39.9912062184,
        longitude: 116.3574832678,
        imageList: [{
          url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/2_building/b_shiyan1.jpg',
        }, {
          url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/2_building/b_shiyan2.jpg',
        }],
        detail: [{
          text: '信息完善中……',
        }],
      }, {
        title: '机电信息楼',
        id: 204,
        latitude: 39.9921925902,
        longitude: 116.3556540012,
        imageList: [{
          url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/2_building/b_jidian1.jpg',
        }, {
          url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/2_building/b_jidian2.jpg',
        }, {
          url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/2_building/b_jidian3.jpg',
        }, {
          url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/2_building/b_jidian4.jpg',
        }, {
          url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/2_building/b_jidian5.jpg',
        }, {
          url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/2_building/b_jidian6.jpg',
        }, {
          url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/2_building/b_jidian7.jpg',
        }, {
          url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/2_building/b_jidian8.jpg',
        }],
        detail: [{
          text: '信息完善中……',
        }],
      }, {
        title: '土木环境楼',
        id: 205,
        latitude: 39.9921638212,
        longitude: 116.3545596600,
        imageList: [{
          url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/2_building/b_tuhuan1.jpg',
        }, {
          url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/2_building/b_tuhuan2.jpg',
        }, {
          url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/2_building/b_tuhuan3.jpg',
        }, {
          url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/2_building/b_tuhuan4.jpg',
        }, {
          url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/2_building/b_tuhuan5.jpg',
        }],
        detail: [{
          text: '信息完善中……',
        }],
      }, {
        title: '理化楼',
        id: 206,
        latitude: 39.9910336019,
        longitude: 116.3549512625,
        imageList: [{
          url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/2_building/b_lihua1.jpg',
        }, {
          url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/2_building/b_lihua2.jpg',
        }, {
          url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/2_building/b_lihua3.jpg',
        }, {
          url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/2_building/b_lihua4.jpg',
        }],
        detail: [{
          text: '信息完善中……',
        }, ]
      }
      // , {
      //   title: '',
      //   id: 20,
      //   latitude: 39.,
      //   longitude: 116.,
      //   imageList: [{
      //     url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/2_building/b_1.jpg',
      //   }, {
      //     url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/2_building/b_2.jpg',
      //   }, {
      //     url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/2_building/b_3.jpg',
      //   }, {
      //     url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/2_building/b_4.jpg',
      //   }],
      //   detail: [{
      //     text: '信息完善中……',
      //   }],
      // }, 
    ]
  },
  {
    name: '宿舍',
    tag: 'dormitory',
    id: 3,
    width: 2,
    points: [{
      latitude: 39.9880127427,
      longitude: 116.3584542274,
    }, {
      latitude: 39.9888142083,
      longitude: 116.3584649563,
    }, {
      latitude: 39.9889251792,
      longitude: 116.3593930006,
    }, {
      latitude: 39.9888964088,
      longitude: 116.3610398769,
    }, {
      latitude: 39.9881565957,
      longitude: 116.3611149788,
    }, {
      latitude: 39.9880538432,
      longitude: 116.3595056534,
    }, {
      latitude: 39.9885881543,
      longitude: 116.3594251873,
    }, {
      latitude: 39.9891882218,
      longitude: 116.3639795780,
    }, {
      latitude: 39.9886703557,
      longitude: 116.3639152050,
    }, {
      latitude: 39.9877990165,
      longitude: 116.3613778353,
    }, {
      latitude: 39.9875113077,
      longitude: 116.3603049517,
    }, {
      latitude: 39.9875852900,
      longitude: 116.3593500853,
    }],
    markers: [{
      id: 300,
      latitude: 39.9880127427,
      longitude: 116.3584542274,
      name: '1斋',
      callout: {
        content: '1斋',
        color: '#4f4f4f',
        fontSize: 9,
        bgColor: '#ffffff00',
        display: 'ALWAYS',
      },
      iconPath: '/resources/location.png',
      width: 30,
      height: 30,
    }, {
      id: 301,
      latitude: 39.9888142083,
      longitude: 116.3584649563,
      name: '2斋',
      callout: {
        content: '2斋',
        color: '#4f4f4f',
        fontSize: 9,
        bgColor: '#ffffff00',
        display: 'ALWAYS',
      },
      iconPath: '/resources/location.png',
      width: 30,
      height: 30,
    }, {
      id: 302,
      latitude: 39.9889251792,
      longitude: 116.3593930006,
      name: '3斋',
      callout: {
        content: '3斋',
        color: '#4f4f4f',
        fontSize: 9,
        bgColor: '#ffffff00',
        display: 'ALWAYS',
      },
      iconPath: '/resources/location.png',
      width: 30,
      height: 30,
    }, {
      id: 303,
      latitude: 39.9888964088,
      longitude: 116.3610398769,
      name: '4斋',
      callout: {
        content: '4斋',
        color: '#4f4f4f',
        fontSize: 9,
        bgColor: '#ffffff00',
        display: 'ALWAYS',
      },
      iconPath: '/resources/location.png',
      width: 30,
      height: 30,
    }, {
      id: 304,
      latitude: 39.9881565957,
      longitude: 116.3611149788,
      name: '5斋',
      callout: {
        content: '5斋',
        color: '#4f4f4f',
        fontSize: 9,
        bgColor: '#ffffff00',
        display: 'ALWAYS',
      },
      iconPath: '/resources/location.png',
      width: 30,
      height: 30,
    }, {
      id: 305,
      latitude: 39.9880538432,
      longitude: 116.3595056534,
      name: '6斋',
      callout: {
        content: '6斋',
        color: '#4f4f4f',
        fontSize: 9,
        bgColor: '#ffffff00',
        display: 'ALWAYS',
      },
      iconPath: '/resources/location.png',
      width: 30,
      height: 30,
    }, {
      id: 306,
      latitude: 39.9885881543,
      longitude: 116.3594251873,
      name: '7斋',
      callout: {
        content: '7斋',
        color: '#4f4f4f',
        fontSize: 9,
        bgColor: '#ffffff00',
        display: 'ALWAYS',
      },
      iconPath: '/resources/location.png',
      width: 30,
      height: 30,
    }, {
      id: 307,
      latitude: 39.9891882218,
      longitude: 116.3639795780,
      name: '8斋',
      callout: {
        content: '8斋',
        color: '#4f4f4f',
        fontSize: 9,
        bgColor: '#ffffff00',
        display: 'ALWAYS',
      },
      iconPath: '/resources/location.png',
      width: 30,
      height: 30,
    }, {
      id: 308,
      latitude: 39.9886703557,
      longitude: 116.3639152050,
      name: '9斋',
      callout: {
        content: '9斋',
        color: '#4f4f4f',
        fontSize: 9,
        bgColor: '#ffffff00',
        display: 'ALWAYS',
      },
      iconPath: '/resources/location.png',
      width: 30,
      height: 30,
    }, {
      id: 309,
      latitude: 39.9877990165,
      longitude: 116.3613778353,
      name: '10斋',
      callout: {
        content: '10斋',
        color: '#4f4f4f',
        fontSize: 9,
        bgColor: '#ffffff00',
        display: 'ALWAYS',
      },
      iconPath: '/resources/location.png',
      width: 30,
      height: 30,
    }, {
      id: 310,
      latitude: 39.9875113077,
      longitude: 116.3603049517,
      name: '11斋',
      callout: {
        content: '11斋',
        color: '#4f4f4f',
        fontSize: 9,
        bgColor: '#ffffff00',
        display: 'ALWAYS',
      },
      iconPath: '/resources/location.png',
      width: 30,
      height: 30,
    }, {
      id: 311,
      latitude: 39.9875852900,
      longitude: 116.3593500853,
      name: '12斋',
      callout: {
        content: '12斋',
        color: '#4f4f4f',
        fontSize: 9,
        bgColor: '#ffffff00',
        display: 'ALWAYS',
      },
      iconPath: '/resources/location.png',
      width: 30,
      height: 30,
    }, ],
    list: [{
      title: '1斋',
      id: 300,
      latitude: 39.9880127427,
      longitude: 116.3584542274,
      imageList: [{
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/3_dormitory/d_1_1.jpg',
      }, {
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/3_dormitory/d_1_2.jpg',
      }, {
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/3_dormitory/d_1_3.jpg',
      }, {
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/3_dormitory/d_1_4.jpg',
      }],
      detail: [{
        text: '女生宿舍，六人间（转角处为五人间）',
      }, {
        text: '图片信息完善中……'
      }],
    }, {
      title: '2斋',
      id: 301,
      latitude: 39.9888142083,
      longitude: 116.3584649563,
      imageList: [{
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/3_dormitory/d_2_1.jpg',
      }, {
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/3_dormitory/d_2_2.jpg',
      }, {
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/3_dormitory/d_2_3.jpg',
      }, {
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/3_dormitory/d_2_4.jpg',
      }],
      detail: [{
        text: '六人间（转角处为五人间）',
      }, {
        text: '图片信息完善中……'
      }],
    }, {
      title: '3斋',
      id: 302,
      latitude: 39.9889251792,
      longitude: 116.3593930006,
      imageList: [{
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/3_dormitory/d_3_1.jpg',
      }, {
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/3_dormitory/d_3_2.jpg',
      }, {
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/3_dormitory/d_3_3.jpg',
      }, {
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/3_dormitory/d_3_4.jpg',
      }],
      detail: [{
        text: '男生宿舍，六人间',
      }, {
        text: '图片信息完善中……'
      }],
    }, {
      title: '4斋',
      id: 303,
      latitude: 39.9888964088,
      longitude: 116.3610398769,
      imageList: [{
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/3_dormitory/d_4_1.jpg',
      }, {
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/3_dormitory/d_4_2.jpg',
      }, {
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/3_dormitory/d_4_3.jpg',
      }, {
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/3_dormitory/d_4_4.jpg',
      }],
      detail: [{
        text: '留学生公寓',
      }, {
        text: '图片信息完善中……'
      }],
    }, {
      title: '5斋',
      id: 304,
      latitude: 39.9881565957,
      longitude: 116.3611149788,
      imageList: [{
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/3_dormitory/d_5_1.jpg',
      }, {
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/3_dormitory/d_5_2.jpg',
      }, {
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/3_dormitory/d_5_3.jpg',
      }, {
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/3_dormitory/d_5_4.jpg',
      }],
      detail: [{
        text: '男生宿舍，六人间（转角处为五人间）',
      }, {
        text: '图片信息完善中……'
      }],
    }, {
      title: '6斋',
      id: 305,
      latitude: 39.9880538432,
      longitude: 116.3595056534,
      imageList: [{
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/3_dormitory/d_6_1.jpg',
      }, {
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/3_dormitory/d_6_2.jpg',
      }, {
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/3_dormitory/d_6_3.jpg',
      }, {
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/3_dormitory/d_6_4.jpg',
      }],
      detail: [{
        text: '男生宿舍，六人间',
      }, {
        text: '图片信息完善中……'
      }],
    }, {
      title: '7斋',
      id: 306,
      latitude: 39.9885881543,
      longitude: 116.3594251873,
      imageList: [{
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/3_dormitory/d_7_1.jpg',
      }, {
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/3_dormitory/d_7_2.jpg',
      }, {
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/3_dormitory/d_7_3.jpg',
      }, {
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/3_dormitory/d_7_4.jpg',
      }],
      detail: [{
        text: '女生宿舍，四人间',
      }, {
        text: '图片信息完善中……'
      }],
    }, {
      title: '8斋',
      id: 307,
      latitude: 39.9891882218,
      longitude: 116.3639795780,
      imageList: [{
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/3_dormitory/d_8_1.jpg',
      }, {
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/3_dormitory/d_8_2.jpg',
      }, {
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/3_dormitory/d_8_3.jpg',
      }, {
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/3_dormitory/d_8_4.jpg',
      }],
      detail: [{
        text: '信息完善中',
      }, {
        text: '图片信息完善中……'
      }],
    }, {
      title: '9斋',
      id: 308,
      latitude: 39.9886703557,
      longitude: 116.3639152050,
      imageList: [{
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/3_dormitory/d_9_1.jpg',
      }, {
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/3_dormitory/d_9_2.jpg',
      }, {
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/3_dormitory/d_9_3.jpg',
      }, {
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/3_dormitory/d_9_4.jpg',
      }],
      detail: [{
        text: '男生宿舍',
      }, {
        text: '图片信息完善中……'
      }],
    }, {
      title: '10斋',
      id: 309,
      latitude: 39.9877990165,
      longitude: 116.3613778353,
      imageList: [{
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/3_dormitory/d_10_1.jpg',
      }, {
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/3_dormitory/d_10_2.jpg',
      }, {
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/3_dormitory/d_10_3.jpg',
      }, {
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/3_dormitory/d_10_4.jpg',
      }],
      detail: [{
        text: '信息完善中',
      }, {
        text: '图片信息完善中……'
      }],
    }, {
      title: '11斋',
      id: 310,
      latitude: 39.9875113077,
      longitude: 116.3603049517,
      imageList: [{
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/3_dormitory/d_11_1.jpg',
      }, {
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/3_dormitory/d_11_2.jpg',
      }, {
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/3_dormitory/d_11_3.jpg',
      }, {
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/3_dormitory/d_11_4.jpg',
      }],
      detail: [{
        text: '信息完善中',
      }, {
        text: '图片信息完善中……'
      }],
    }, {
      title: '12斋',

      id: 311,
      latitude: 39.9875852900,
      longitude: 116.3593500853,
      imageList: [{
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/3_dormitory/d_12_1.jpg',
      }, {
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/3_dormitory/d_12_2.jpg',
      }, {
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/3_dormitory/d_12_3.jpg',
      }, {
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/3_dormitory/d_12_4.jpg',
      }],
      detail: [{
        text: '信息完善中',
      }, {
        text: '图片信息完善中……'
      }],
    }, ]
  },
  {
    name: '餐饮',
    tag: 'food',
    id: 4,
    width: 2,
    points: [{
      latitude: 39.9889786098,
      longitude: 116.3618820906,
    }, {
      latitude: 39.9888594184,
      longitude: 116.3576173784,
    }, {
      latitude: 39.9886867959,
      longitude: 116.3625848293,
    }, {
      latitude: 39.9915884390,
      longitude: 116.3595914841,
    }, {
      latitude: 39.9908733147,
      longitude: 116.3620805742,
    }],
    markers: [{
      id: 400,
      latitude: 39.9889786098,
      longitude: 116.3618820906,
      name: '万秀园',
      callout: {
        content: '万秀园',
        color: '#4f4f4f',
        fontSize: 9,
        bgColor: '#ffffff00',
        display: 'ALWAYS',
      },
      iconPath: '/resources/location.png',
      width: 30,
      height: 30,
    }, {
      id: 401,
      latitude: 39.9888594184,
      longitude: 116.3576173784,
      name: '鸿博园',
      callout: {
        content: '鸿博园',
        color: '#4f4f4f',
        fontSize: 9,
        bgColor: '#ffffff00',
        display: 'ALWAYS',
      },
      iconPath: '/resources/location.png',
      width: 30,
      height: 30,
    }, {
      id: 402,
      latitude: 39.9886867959,
      longitude: 116.3625848293,
      name: '友谊餐厅',
      callout: {
        content: '友谊餐厅',
        color: '#4f4f4f',
        fontSize: 9,
        bgColor: '#ffffff00',
        display: 'ALWAYS',
      },
      iconPath: '/resources/location.png',
      width: 30,
      height: 30,
    }, {
      id: 403,
      latitude: 39.9915884390,
      longitude: 116.3595914841,
      name: '校内小吃',
      callout: {
        content: '校内小吃',
        color: '#4f4f4f',
        fontSize: 9,
        bgColor: '#ffffff00',
        display: 'ALWAYS',
      },
      iconPath: '/resources/location.png',
      width: 30,
      height: 30,
    }, {
      id: 404,
      latitude: 39.9908733147,
      longitude: 116.3620805742,
      name: '咖啡厅',
      callout: {
        content: '咖啡厅',
        color: '#4f4f4f',
        fontSize: 9,
        bgColor: '#ffffff00',
        display: 'ALWAYS',
      },
      iconPath: '/resources/location.png',
      width: 30,
      height: 30,
    }, ],
    list: [{
      title: '万秀园',
      id: 400,
      latitude: 39.9889786098,
      longitude: 116.3618820906,
      imageList: [{
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/4_restaurant/r_wanxiu1.jpg',
      }, {
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/4_restaurant/r_wanxiu2.jpg',
      }, {
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/4_restaurant/r_wanxiu3.jpg',
      }, {
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/4_restaurant/r_wanxiu4.jpg',
      }],
      detail: [{
        text: '一层二层为基本伙食，三层为风味小炒，四层对外开放，餐厅化管理，可收现金，可预定包间。',
      }, {
        text: '开饭时间：早饭6:30-8:30，中饭：10:45-13:00，晚饭：16:45-18:50，夜宵：19:00-20:00。',
      }],
    }, {
      title: '鸿博园',
      id: 401,
      latitude: 39.9888594184,
      longitude: 116.3576173784,
      imageList: [{
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/4_restaurant/r_hongbo1.jpg',
      }, {
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/4_restaurant/r_hongbo2.jpg',
      }, {
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/4_restaurant/r_hongbo3.jpg',
      }, {
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/4_restaurant/r_hongbo4.jpg',
      }],
      detail: [{
        text: '一层二层为基本伙食，三层为清真食堂，吃清真餐的同学可在此就餐。',
      }, {
        text: '开饭时间：早饭6:30-8:30，中饭：10:45-13:00，晚饭：16:45-18:50。',
      }, {
        text: '注意：鸿博三层为清真食堂，三层的餐具不能与其他楼层混用，且非清真食物不可带入。',
      }],
    }, {
      title: '友谊餐厅',
      id: 402,
      latitude: 39.9886867959,
      longitude: 116.3625848293,
      imageList: [{
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/4_restaurant/r_youyi1.jpg',
      }],
      detail: [{
        text: '营业时间： 周一至周日 10:00-14:00 17:00-22:00',
      }, {
        text: '',
      }, {
        text: '',
      }],
    }, {
      title: '校内小吃',
      id: 403,
      latitude: 39.9915884390,
      longitude: 116.3595914841,
      imageList: [{
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/4_restaurant/r_xiaochi1.jpg',
      }],
      detail: [{
        text: '操场北面有小吃街，旁边还有一些小店铺，如水果店、小笼包子铺。',
      }, {
        text: '学校内两个物美超市（分别操场的南面和北面）有现做的面包点心。',
      }, {
        text: '还有各种新增微店比如小麦公社（腐蚀楼旁）、许鲜（大物美超市一层）等。',
      }],
    }, {
      title: '咖啡厅',
      id: 404,
      latitude: 39.9908733147,
      longitude: 116.3620805742,
      imageList: [{
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/4_restaurant/r_coffee1.jpg',
      }, {
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/4_restaurant/r_coffee2.jpg',
      }, {
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/4_restaurant/r_coffee3.jpg',
      }, {
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/4_restaurant/r_coffee4.jpg',
      }],
      detail: [{
        text: '瑞幸咖啡：（鸿博园店、万秀园店、学生活动中心店、体育馆店、逸夫楼店）校园咖啡店，可以通过手机下载luckin APP购买',
      }, {
        text: '国安社区：大物美旁',
      }, {
        text: '时光北岸咖啡：学生活动中心东侧走廊尽头（7斋一层）',
      }, {
        text: '酷云咖啡：（图书馆内）需刷学生卡进入',
      }, {
        text: '90°炭烧咖啡：大物美一层（3斋一层）',
      }, {
        text: 'UniverCity Coffee：小物美门口面包店内',
      }, {
        text: '自助咖啡机：冶金楼一层、主楼二层、土环楼一层、二层和四层',
      }],
    }, ]
  },
  {
    name: '场馆',
    tag: 'venue',
    id: 5,
    width: 2,
    points: [{
      latitude: 39.9902444927,
      longitude: 116.3572043180,
    }, {
      latitude: 39.9885840443,
      longitude: 116.3597577810,
    }, {
      latitude: 39.9904006709,
      longitude: 116.3622575998,
    }, {
      latitude: 39.9903308015,
      longitude: 116.3598489761,
    }, {
      latitude: 39.9889375093,
      longitude: 116.3566678762,
    }],
    markers: [{
      id: 500,
      latitude: 39.9902444927,
      longitude: 116.3572043180,
      name: '图书馆',
      callout: {
        content: '图书馆',
        color: '#4f4f4f',
        fontSize: 9,
        bgColor: '#ffffff00',
        display: 'ALWAYS',
      },
      iconPath: '/resources/location.png',
      width: 30,
      height: 30,
    }, {
      id: 501,
      latitude: 39.9885840443,
      longitude: 116.3597577810,
      name: '学生活动中心',
      callout: {
        content: '学生活动中心',
        color: '#4f4f4f',
        fontSize: 9,
        bgColor: '#ffffff00',
        display: 'ALWAYS',
      },
      iconPath: '/resources/location.png',
      width: 30,
      height: 30,
    }, {
      id: 502,
      latitude: 39.9904006709,
      longitude: 116.3622575998,
      name: '体育馆',
      callout: {
        content: '体育馆',
        color: '#4f4f4f',
        fontSize: 9,
        bgColor: '#ffffff00',
        display: 'ALWAYS',
      },
      iconPath: '/resources/location.png',
      width: 30,
      height: 30,
    }, {
      id: 503,
      latitude: 39.9903308015,
      longitude: 116.3598489761,
      name: '体育场',
      callout: {
        content: '体育场',
        color: '#4f4f4f',
        fontSize: 9,
        bgColor: '#ffffff00',
        display: 'ALWAYS',
      },
      iconPath: '/resources/location.png',
      width: 30,
      height: 30,
    }, {
      id: 504,
      latitude: 39.9889375093,
      longitude: 116.3566678762,
      name: '教职工礼堂',
      callout: {
        content: '教职工礼堂',
        color: '#4f4f4f',
        fontSize: 9,
        bgColor: '#ffffff00',
        display: 'ALWAYS',
      },
      iconPath: '/resources/location.png',
      width: 30,
      height: 30,
    }, ],
    list: [{
        title: '图书馆',
        id: 500,
        latitude: 39.9902444927,
        longitude: 116.3572043180,
        imageList: [{
          url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/5_venue/v_lib_1.jpg',
        }, {
          url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/5_venue/v_lib_2.jpg',
        }, {
          url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/5_venue/v_lib_3.jpg',
        }, {
          url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/5_venue/v_lib_4.jpg',
        }, {
          url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/5_venue/v_lib_5.jpg',
        }],
        detail: [{
          text: '开馆时间：8:00~22：00（周六开馆时间为8:00~11:30和14:00~17:30，另外每个月的最后一个周五14:00~18:00闭馆培训，有空调，暖气。）',
        }, {
          text: '进出图书馆需要校园卡，自习要现场选座或在北京科技大学图书馆公众号预约，每到期末时图书馆都会爆满，图书馆将提前一小时开馆，因此需要同学早起排队。',
        }, {
          text: '图书馆借阅书籍需要校园卡，时间为30天，到期可续借；新书阅览室书籍借阅时间为14天。',
        }],
      },
      //, {
      //   title: '经管学院图书馆',
      //   id: 501,
      //   latitude: 39.,
      //   longitude: 116.,
      //   imageList: [{
      //     url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/5_venue/v_1.jpg',
      //   }, {
      //     url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/5_venue/v_2.jpg',
      //   }, {
      //     url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/5_venue/v_3.jpg',
      //   }, {
      //     url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/5_venue/v_4.jpg',
      //   }],
      //   detail: [{        text: '信息完善中……',      }],
      // }, 
      {
        title: '学生活动中心',
        id: 501,
        latitude: 39.9885840443,
        longitude: 116.3597577810,
        imageList: [{
          url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/5_venue/v_xuehuo_1.jpg',
        }, {
          url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/5_venue/v_xuehuo_2.jpg',
        }, {
          url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/5_venue/v_xuehuo_3.jpg',
        }, {
          url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/5_venue/v_xuehuo_4.jpg',
        }],
        detail: [{
          text: '学生活动中心简称学活，位于7斋楼下，进门东侧为心理辅导中心，西侧是就业指导中心。瑞幸咖啡后面是民乐团、管乐团排练室。二楼为校学生会、校团委办公场所。往西(右)地下一层:时代凌宇报告厅 ，往东(左)地下一层:多功能厅，平时多为社团排练借用。学活地下室：爱心满屋办公室、绿盾办公室、各社团活动中心(可借用)',
        }],
      }, {
        title: '体育馆',
        id: 502,
        latitude: 39.9904006709,
        longitude: 116.3622575998,
        imageList: [{
          url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/5_venue/v_gym_1.jpg',
        }, {
          url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/5_venue/v_gym_2.jpg',
        }, {
          url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/5_venue/v_gym_3.jpg',
        }, {
          url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/5_venue/v_gym_4.jpg',
        }],
        detail: [{
          text: '北京科技大学体育馆是2008年北京奥运会新建的四个高校比赛场馆之一，承担第29届奥运会柔道、跆拳道比赛和第13届残奥会轮椅篮球、轮椅橄榄球比赛项目。体育馆分为球类馆和游泳馆，球类馆经营项目为羽毛球、乒乓球、篮球、网球，游泳馆为25m*50m标准泳池。',
        }, {
          text: '体育馆及游泳馆开放时间可在北京科技大学体育馆公众号查看。',
        }],
      }, {
        title: '体育场',
        id: 503,
        latitude: 39.9903308015,
        longitude: 116.3598489761,
        imageList: [{
          url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/5_venue/v_feild_1.jpg',
        }, {
          url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/5_venue/v_feild_2.jpg',
        }, {
          url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/5_venue/v_feild_3.jpg',
        }, {
          url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/5_venue/v_feild_4.jpg',
        }],
        detail: [{
          text: '羽毛球场、乒乓球场、灯光篮球场、排球场、网球场需要带学生卡或者学生证去体育馆前台预定场地（学生可提前三天订场地）。有体育课的时不对外开放。',
        }, {
          text: '',
        }],
      }, {
        title: '教职工礼堂',
        id: 504,
        latitude: 39.9889375093,
        longitude: 116.3566678762,
        imageList: [{
          url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/5_venue/v_litang_1.jpg',
        }, {
          url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/5_venue/v_litang_2.jpg',
        }, {
          url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/5_venue/v_litang_3.jpg',
        }, {
          url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/5_venue/v_litang_4.jpg',
        }],
        detail: [{
          text: '教职工礼堂位于鸿博园西侧，是学校大型活动的举办场所。',
        }],
      },
    ]
  },
  {
    name: '出入门',
    tag: 'gates',
    id: 6,
    width: 3,
    points: [{
      latitude: 39.9901417429,
      longitude: 116.3536691666,
    }, {
      latitude: 39.9893937232,
      longitude: 116.3652133942,
    }, {
      latitude: 39.9934090955,
      longitude: 116.3577783108,
    }, {
      latitude: 39.9875071975,
      longitude: 116.3626599315,
    }, {
      latitude: 39.9874825370,
      longitude: 116.3616245988,
    }, {
      latitude: 39.9873469024,
      longitude: 116.3581162691,
    }],
    markers: [{
      id: 600,
      latitude: 39.9901417429,
      longitude: 116.3536691666,
      name: '西门',
      callout: {
        content: '西门',
        color: '#4f4f4f',
        fontSize: 9,
        bgColor: '#ffffff00',
        display: 'ALWAYS',
      },
      iconPath: '/resources/location.png',
      width: 30,
      height: 30,
    }, {
      id: 601,
      latitude: 39.9893937232,
      longitude: 116.3652133942,
      name: '东门',
      callout: {
        content: '东门',
        color: '#4f4f4f',
        fontSize: 9,
        bgColor: '#ffffff00',
        display: 'ALWAYS',
      },
      iconPath: '/resources/location.png',
      width: 30,
      height: 30,
    }, {
      id: 602,
      latitude: 39.9934090955,
      longitude: 116.3577783108,
      name: '北门',
      callout: {
        content: '北门',
        color: '#4f4f4f',
        fontSize: 9,
        bgColor: '#ffffff00',
        display: 'ALWAYS',
      },
      iconPath: '/resources/location.png',
      width: 30,
      height: 30,
    }, {
      id: 603,
      latitude: 39.9875071975,
      longitude: 116.3626599315,
      name: '南1门',
      callout: {
        content: '南1门',
        color: '#4f4f4f',
        fontSize: 9,
        bgColor: '#ffffff00',
        display: 'ALWAYS',
      },
      iconPath: '/resources/location.png',
      width: 30,
      height: 30,
    }, {
      id: 604,
      latitude: 39.9874825370,
      longitude: 116.3616245988,
      name: '南2门',
      callout: {
        content: '南2门',
        color: '#4f4f4f',
        fontSize: 9,
        bgColor: '#ffffff00',
        display: 'ALWAYS',
      },
      iconPath: '/resources/location.png',
      width: 30,
      height: 30,
    }, {
      id: 605,
      latitude: 39.9873469024,
      longitude: 116.3581162691,
      name: '南3门',
      callout: {
        content: '南3门',
        color: '#4f4f4f',
        fontSize: 9,
        bgColor: '#ffffff00',
        display: 'ALWAYS',
      },
      iconPath: '/resources/location.png',
      width: 30,
      height: 30,
    }, ],
    list: [{
      title: '西门',
      id: 600,
      latitude: 39.9901417429,
      longitude: 116.3536691666,
      imageList: [{
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/6_gate/g_west1.jpg',
      }],
      detail: [{
        text: '信息完善中……',
      }],
    }, {
      title: '东门',
      id: 601,
      latitude: 39.9893937232,
      longitude: 116.3652133942,
      imageList: [{
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/6_gate/g_east1.jpg',
      }],
      detail: [{
        text: '信息完善中……',
      }],
    }, {
      title: '北门',
      id: 602,
      latitude: 39.9934090955,
      longitude: 116.3577783108,
      imageList: [{
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/6_gate/g_north1.jpg',
      }],
      detail: [{
        text: '信息完善中……',
      }],
    }, {
      title: '南1门',
      id: 603,
      latitude: 39.9875071975,
      longitude: 116.3626599315,
      imageList: [{
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/7_service/s_south1_1.jpg',
      }, {
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/7_service/s_south1_2.jpg',
      }],
      detail: [{
        text: '信息完善中……',
      }],
    }, {
      title: '南2门',
      id: 604,
      latitude: 39.9874825370,
      longitude: 116.3616245988,
      imageList: [{
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/7_service/s_south2_1.jpg',
      }, {
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/7_service/s_south2_2.jpg',
      }],
      detail: [{
        text: '信息完善中……',
      }],
    }, {
      title: '南3门',
      id: 605,
      latitude: 39.9873469024,
      longitude: 116.3581162691,
      imageList: [{
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/7_service/s_south3_1.jpg',
      }, {
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/7_service/s_south3_2.jpg',
      }],
      detail: [{
        text: '信息完善中……',
      }],
    }, ]
  },
  {
    name: '服务',
    tag: 'service',
    id: 7,
    width: 2,
    points: [{
      latitude: 39.9895745638,
      longitude: 116.3576817513,
    }, {
      latitude: 39.9912103282,
      longitude: 116.3610613346,
    }, {
      latitude: 39.9890402605,
      longitude: 116.3597095013,
    }, {
      latitude: 39.9877085941,
      longitude: 116.3561958075,
    }, {
      latitude: 39.9883621001,
      longitude: 116.3566356897,
    }],
    markers: [{
      id: 700,
      latitude: 39.9895745638,
      longitude: 116.3576817513,
      name: 'ATM',
      callout: {
        content: 'ATM',
        color: '#4f4f4f',
        fontSize: 9,
        bgColor: '#ffffff00',
        display: 'ALWAYS',
      },
      iconPath: '/resources/location.png',
      width: 30,
      height: 30,
    }, {
      id: 701,
      latitude: 39.9912103282,
      longitude: 116.3610613346,
      name: '停车场',
      callout: {
        content: '停车场',
        color: '#4f4f4f',
        fontSize: 9,
        bgColor: '#ffffff00',
        display: 'ALWAYS',
      },
      iconPath: '/resources/location.png',
      width: 30,
      height: 30,
    }, {
      id: 702,
      latitude: 39.9890402605,
      longitude: 116.3597095013,
      name: '商店',
      callout: {
        content: '商店',
        color: '#4f4f4f',
        fontSize: 9,
        bgColor: '#ffffff00',
        display: 'ALWAYS',
      },
      iconPath: '/resources/location.png',
      width: 30,
      height: 30,
    }, {
      id: 703,
      latitude: 39.9877085941,
      longitude: 116.3561958075,
      name: '快递',
      callout: {
        content: '快递',
        color: '#4f4f4f',
        fontSize: 9,
        bgColor: '#ffffff00',
        display: 'ALWAYS',
      },
      iconPath: '/resources/location.png',
      width: 30,
      height: 30,
    }, {
      id: 704,
      latitude: 39.9883621001,
      longitude: 116.3566356897,
      name: '打印店',
      callout: {
        content: '打印店',
        color: '#4f4f4f',
        fontSize: 9,
        bgColor: '#ffffff00',
        display: 'ALWAYS',
      },
      iconPath: '/resources/location.png',
      width: 30,
      height: 30,
    }, ],
    list: [{
      title: 'ATM',
      id: 700,
      latitude: 39.9895745638,
      longitude: 116.3576817513,
      imageList: [{
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/7_service/s_ATM1.jpg',
      }, {
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/7_service/s_ATM2.jpg',
      }, {
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/7_service/s_ATM3.jpg',
      }],
      detail: [{
        text: '学校3斋一层西侧物美门口旁有中国建设银行的ATM机；',
      }, {
        text: '鸿博园对面有工商银行的ATM机；',
      }, {
        text: '图书馆南有中行的营业厅，营业厅里有存取款一体的ATM机。',
      }, {
        text: '学校东门外有北京银行。',
      }, {
        text: '学校北门方兴大厦内有工商银行。',
      }, {
        text: '校西门北侧麦当劳处也有建设银行的ATM机。',
      }, {
        text: '在矿业大学的旁边有中国农业银行。',
      }],
    }, {
      title: '停车场',
      id: 701,
      latitude: 39.9912103282,
      longitude: 116.3610613346,
      imageList: [{
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/7_service/s_parking1.jpg',
      }],
      detail: [{
        text: '体育馆北和五环广场北有停车场，收费每小时10元。',
      }, {
        text: '开学期间学校还会开放临时停车场。',
      }],
    }, {
      title: '商店',
      id: 702,
      latitude: 39.9890402605,
      longitude: 116.3597095013,
      imageList: [{
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/7_service/s_market1.jpg',
      }],
      detail: [{
        text: '三斋地下一层和排球场对面有物美超市。',
      }, {
        text: '鸿博北中国银行旁边有小卖部。',
      }, {
        text: '各斋宿舍楼、冶金楼一层有自动贩卖机。',
      }, {
        text: '物美超市附近有拍照、清洗衣物、修理电脑、蛋糕店、水果等商店。',
      }],
    }, {
      title: '快递',
      id: 703,
      latitude: 39.9877085941,
      longitude: 116.3561958075,
      imageList: [{
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/7_service/s_kuaidi1.jpg',
      }, {
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/7_service/s_kuaidi2.jpg',
      }, {
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/7_service/s_kuaidi3.jpg',
      }, {
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/7_service/s_kuaidi4.jpg',
      }],
      detail: [{
        text: '快递收寄同地，位于腐蚀楼旁、小物美对面、南3门、南2门。',
      }, {
        text: '寄件和取大件需要在19点前，近邻宝柜子里的快递24小时可取。',
      }],
    }, {
      title: '打印店',
      id: 704,
      latitude: 39.9883621001,
      longitude: 116.3566356897,
      imageList: [{
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/7_service/s_print1.jpg',
      }, {
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/7_service/s_print2.jpg',
      }, {
        url: 'https://wx-source-1251959181.cos.ap-beijing.myqcloud.com/USTB-Navigate/photo/7_service/s_print3.jpg',
      }],
      detail: [{
        text: '科大图文中心：教职工礼堂南侧',
      }, {
        text: '贝壳印舍：七斋（学生活动中心）',
      }, {
        text: '物美打印店：三斋（物美一层西侧）',
      }, {
        text: '中国银行旁边的打印店',
      }, {
        text: '图书馆南侧小卖部',
      }, {
        text: '机电楼打印店：一层西侧',
      }],
    }, ]
  },
]

module.exports = {
  listData: listData
}